Repository: GNOME/accerciser
Catalog: help/*/*.po
Languages: gl, ja

source: This plugin checks applications for accessibility problems and generates a report including the severity and description of the problems. The report links errors to documentation about how to remedy common problems. The plugin is extensible with test schemas that define rules for validation.
gl: Este complemento comproba os problemas de accesibilidade nas aplicacións e xenera un informe que inclúe a importancia e descrición dos problemas. O informe liga os erros á documentación que informa sobre como resolvelos problemas comúns. O complemento é extensíbel cos esquemas de comprobación que definen regras de validación.
ja: このプラグインはアプリケーションのアクセシビリティ問題を調査し、問題の重大性および説明を含んだレポートを発行します。レポートはエラーと、共通の問題の対処のしかたについての文書を結びつけます。本プラグインは検証ルールを定義したテスト・スキーマによって拡張可能です。

source: To run the validator, first select an item in the accessibility tree. The plugin will test the selected accessible and all of its descendants. Next select a schema to use for the test. Then click the <guibutton>Validate</guibutton> button to start the test. While the test is running, click the button again to cancel it.
gl: Para executar o validador, primeiro seleccione un elemento da árbore de accesibilidade. O complemento comprobará o accesíbel seleccionado e todolos seus descendentes. De seuido seleccione un esquema que se empregará para comprobar. Entón faga clic no botón <guibutton>Validar</guibutton> para comezar a comprobación. Mentres se está a executar a comprobación, pode facer clic no botón de novo para cancelala.
ja: 検証機能を起動するためには、まずアクセシビリティ・ツリーの要素を選択します。プラグインは選択されたウィジェットとその子孫全てをテストします。次に、テストに使用するスキーマを選択します。それから <guibutton>Validate</guibutton> をクリックし、テストを開始します。テスト実行中の間、そのボタンをクリックするとテストをキャンセルします。

source: When the test completes, the report table shows the severity and description of all errors. Double click a row in the table to show the associated accessible in the tree. With an item selected, click the <guibutton>Help</guibutton> to get information about how to resolve the problem.
gl: Cando a comprobación remate, a tabo de informe amosa a importación e descrición dos erros. FAga dobre clic nunha fila da táboa para amosar o accesíbel asociado na árbore. Con un elemento seleccionado, faga clic en <guibutton>Axuda</guibutton> para obter máis información sobre como resolver o problema.
ja: テストが完了すると、レポート表は全エラーの重大性と説明を表示します。表の行をダブルクリックすると、ツリー上の関連するウィジェットを表示します。要素を選択して <guibutton>Help</guibutton> をクリックすると、問題の解決方法についての情報を取得できます。

source: Preferences
gl: Preferencias
ja: 設定

source: There are some elements in <application>Accerciser</application> that are configurable:
gl: Hai algúns elementos en <application>Accerciser</application> que son configurables:
ja: <application>Accerciser</application> には設定可能な要素がいくつかある:

source: Plugin Layout
gl: Disposicións
ja: プラグイン・レイアウト

source: There are two methods for configuring plugin layout in <application>Accerciser</application>. First you may choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> to activate the <guilabel>Preferences</guilabel> dialog. This dialog contains tabs for each section, select the <guilabel>Plugins</guilabel> tab. Under this section you will find a list view of all the available plugins. Right-click on any of the plugins listed to configure it's view.
gl: Hai dous xeitos de configurar a disposición de complementos en <application>Accerciser</application>. Primeiro podería escoller<menuchoice><guimenu>Editar</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice> para activar o diálogo <guilabel>Preferencias</guilabel>. Este diálogo contén separadores para cada sección, seleccione o separador <guilabel>Complementos</guilabel>. Baixo esta sección atopará un alista de tódolos complementos dispoñíbles. Se fai clic co botón dereito en calquera dos complementos listados pode configurar a súa vista.
ja: <application>Accerciser</application> のプラグイン・レイアウトを設定する方法はふたつあります。ひとつは、<menuchoice><guimenu>編集</guimenu><guimenuitem>設定</guimenuitem></menuchoice>を選択し、<guilabel>設定</guilabel> 画面を開きます。この画面には各セクションのタブがありますが、<guilabel>プラグインの一覧</guilabel>タブを選択してください。このセクションでは利用可能な全プラグインの一覧表示をみることができます。表示を設定するためには一覧のいずれかのプラグインを右クリックしてください。

source: You may bypass the <guilabel>Preferences</guilabel> dialog by using drag and drop to move plugin tabs. Dragging a plugin tab to the bottom or right plugin area in the main window will move the plugin. Dragging a tab to the desktop will create a new plugin window and drop the plugin in it.
gl: Pode saltarse o diálogo de <guilabel>Preferencias</guilabel> empregando arrastrar e soltar para mover o separador de complementos. Arrastrando o separador de complementos cara a área de complementos inferior ou dereita na fiestra principal movera os complementos. Arrastrando o separador ó escritorio creará unha nova fiestra de complementos e crearasse o complemento nela.
ja: プラグインのタブをドラッグ・アンド・ドロップすることで<guilabel>設定</guilabel>画面を抜かすことができます。プラグインのタブを、メイン・ウィンドウの下部あるいは右部にあるプラグインエリアへドラッグすることで、プラグインを移動させることができます。タブをデスクトップにドラッグすれば、新しくプラグイン・ウィンドウを作成し、そこにプラグインをドロップすることができます。

source: Global Hotkey Configuration
gl: Configuración global de atallos de teclado
ja: グローバルなホットキーの設定

source: Some elements in <application>Accerciser</application> may enable certain functionality via hotkeys. The hotkey combination could be changed via the <guilabel>Preferences</guilabel> dialog, to do so you may select <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> to activate the <guilabel>Preferences</guilabel> dialog. This dialog contains tabs for each section, select the <guilabel>Global Hotkeys</guilabel> tab. Under this section you will find a list view of all the available hotkey features. Change the key bindings to you liking.
gl: Algúns elementos de <application>Accerciser</application> poden activar algunha funcionalidade por medio de atallos de teclado. Os atallos de teclado poden cambiarse no diálogo de <guilabel>Preferencias</guilabel>, pode seleccionar <menuchoice><guimenu>Editar</guimenu> <guimenuitem>Preferencias</guimenuitem></menuchoice> para activar o diálogo de <guilabel>Preferencias</guilabel>. Este diálogo contén separadores para cada sección, seleccione o separador <guilabel>Atallos de teclado globais</guilabel>. Baixo esta sección pode atopar unha lista de tódolos atallos de teclado. Cambie os mesmos ao seu gusto.
ja: <application>Accerciser</application> のいくつかの要素はホットキーを通じて機能を有効化することができます。ホットキーの組み合わせは<guilabel>設定</guilabel>画面を通じて変更できます。<menuchoice><guimenu>編集</guimenu><guimenuitem>設定</guimenuitem></menuchoice>を選択し、<guilabel>設定</guilabel>画面を開いてください。この画面は各セクションのタブがありますが、<guilabel>グローバルなホットキー</guilabel>タブを選択してください。このセクションでは利用可能な全ホットキーの特徴の一覧表示をみることができます。お好みに応じてキー・バインディングを変更してください。

source: About <application>Accerciser</application>
gl: Sobre <application>Accerciser</application>
ja: <application>Accerciser</application> について

source: <application>Accerciser</application> was written by Eitan Isaacson (<email>eitan@ascender.com</email>). To find more information about <application>Accerciser</application>, please visit the <ulink url="http://live.gnome.org/Accerciser" type="http"><application>Accerciser</application> GNOME Live! page</ulink>.
gl: <application>Accerciser</application> foi escrito por Eitan Isaacson (<email>eitan@ascender.com</email>). Para obter máis información sobre<application>Accerciser</application>, visite a <ulink url="http://live.gnome.org/Accerciser" type="http">páxina en GNOME Live! de <application>Accerciser</application></ulink>.
ja: <application>Accerciser</application> は Eitan Isaacson (<email>eitan@ascender.com</email>) によって書かれました。<application>Accerciser</application> についてさらに情報を探すには<ulink url="http://live.gnome.org/Accerciser" type="http"><application>Accerciser</application> GNOME Live! page</ulink>にアクセスしてください。

source: To report a bug or make a suggestion regarding this application or this manual, follow the directions in this <ulink url="ghelp:gnome-feedback" type="help">document</ulink>.
gl: Para informar dunha falla ou facer unha suxestión desta aplicación ou este manual, siga os pasos no <ulink url="ghelp:gnome-feedback" type="help">documento</ulink>.
ja: バグの報告あるいは本アプリケーション、本マニュアルについての提案をするには、本<ulink url="ghelp:gnome-feedback" type="help">ドキュメント</ulink>の指示にしたがってください。

source: Redistribution and use in source and binary forms, with or without modification, are permitted under the terms of the BSD License.
gl: A redistribución e uso das fontes ou binarios, con ou sen modificación está permitida baixo os termos da Licenza BSD.
ja: ソースコードおよびバイナリフォーマットでの再頒布、使用については、改版の有無に関わらず、BSDライセンスの条項の下で許可されています。

source: translator-credits
gl: Francisco Diéguez <fran.dieguez@glug.es>, 2009
ja: 松澤二郎 <matsuzawa.jr@gmail.com>, 2010. 日本GNOMEユーザ会 <http://www.gnome.gr.jp/>, 2010.
