Repository: GNOME/accerciser
Catalog: help/*/*.po
Languages: gl, ja

source: <application>Accerciser</application> Manual v0.2.0
gl: Manual de <application>Accerciser</application> v0.2.0
ja: <application>Accerciser</application> マニュアル v0.2.0

source: IBM Corporation
gl: Corporación IBM

source: GNOME Documentation Project
gl: Proxecto de Documentación de GNOME
ja: GNOME ドキュメントプロジェクト

source: Accerciser team
gl: Equipo de Accerciser
ja: Accerciser チーム

source: Accerciser Manual v0.2.0
gl: Manual de Accerciser v0.2.0
ja: Accerciser マニュアル v0.2.0

source: This manual describes version 0.1.5 of Accerciser.
gl: Este manual describe a versión 0.1.5 de Accerciser.
ja: このマニュアルは Accerciser バージョン 0.1.5 について説明しています。

source: This manual describes the use of <application>Accerciser</application>.
gl: Este manual describe o uso de <application>Accerciser</application>.
ja: このマニュアルは <application>Accerciser</application> の使用法について説明しています。

source: Feedback
gl: Retroacción
ja: フィードバック

source: To report a bug or make a suggestion regarding the <application>Accerciser</application> application or this manual, follow the directions in the <ulink url="ghelp:gnome-feedback" type="help">GNOME Feedback Page</ulink>.
gl: Para informar dunha falla ou facer unha suxestión sobre <application>Accerciser</application> ou este manual, siga os pasos na <ulink url="ghelp:gnome-feedback" type="help">Páxina de Retroacción de GNOME</ulink>.
ja: バグの報告あるいは <application>Accerciser</application>、本マニュアルについての提案をするには、<ulink url="ghelp:gnome-feedback" type="help">GNOME Feedback Page</ulink>の指示にしたがってください。

source: Introduction
gl: Introdución
ja: はじめに

source: <application>Accerciser</application> is an interactive Python accessibility explorer for the GNOME desktop. It uses <ulink url="http://directory.fsf.org/at-spi.html" type="http">AT-SPI</ulink> to inspect and control widgets, allowing you to check if an application is providing correct information to assistive technologies and automated test frameworks. <application>Accerciser</application> has a simple plugin framework which you can use to create custom views of accessibility information.
gl: <application>Accerciser</application> é un explorador de accesibilidade interactivo escrito en Python para o escritorio GNOME. Emprega <ulink url="http://directory.fsf.org/at-spi.html" type="http">AT-SPI</ulink> para analizar e controlar os widgets, permitíndolle comprobar se unha aplicación está proporcionando a información correcta para as tecnoloxías de asistencia e frameworks de comprobación <application>Accerciser</application> conta con un framework sinxelo que pode empregar para crear vistas personalizadas de información de accesibilidade.
ja: <application>Accerciser</application> は、GNOME デスクトップのための対話型の Python アクセシビリティ・エクスプローラです。ウィジェットを検査、制御するために <ulink url="http://directory.fsf.org/at-spi.html" type="http">AT-SPI</ulink> を使用し、アプリケーションが支援技術への適切な情報を提供しているか、また自動化されたテストフレームワークであるかをチェックすることができます。<application>Accerciser</application> はシンプルなプラグイン・フレームワークを持っており、支援技術のカスタム・ビューを作成するためにそれを使用することができます。

source: In essence, <application>Accerciser</application> is a next generation <ulink url="http://svn.gnome.org/viewcvs/at-poke" type="http">at-poke</ulink> tool.
gl: En esencia, <application>Accerciser</application> é a nova xeración da ferramenta <ulink url="http://svn.gnome.org/viewcvs/at-poke" type="http">at-poke</ulink>.
ja: 本質的に、<application>Accerciser</application> は次世代の <ulink url="http://svn.gnome.org/viewcvs/at-poke" type="http">at-poke</ulink> ツールです。

source: Getting Started
gl: Comecemos
ja: 基本的な使用方法

source: To Start <application>Accerciser</application>
gl: Arrincar <application>Accerciser</application>
ja: <application>Accerciser</application> を起動するために

source: You can start <application>Accerciser</application> in the following ways:
gl: Pode executar <application>Accerciser</application> dos seguintes xeitos:
ja: 以下の手順で <application>Accerciser</application> を起動できます。

source: <guimenu>Applications</guimenu> menu
gl: Menú de <guimenu>Aplicacións</guimenu>
ja: <guimenu>アプリケーション</guimenu>・メニュー

source: Choose the <menuchoice><guisubmenu>Programming</guisubmenu><guimenuitem>Accerciser</guimenuitem></menuchoice> menu item.
gl: Elixa o elemento de menú <menuchoice><guisubmenu>Programación</guisubmenu><guimenuitem>Accerciser</guimenuitem></menuchoice>
ja: <menuchoice><guisubmenu>プログラミング</guisubmenu><guimenuitem>Accerciser</guimenuitem></menuchoice> のメニュー項目を選択する。

source: Command line
gl: Liña de ordes
ja: コマンド・ライン

source: Type the following command in a console window then press <keycap>Return</keycap>:
gl: Escriba os seguintes comandos na fiestra de terminal e logo pulse <keycap>Enter</keycap>:
ja: コンソール・ウィンドウで以下のコマンドを入力し、<keycap>Return</keycap> を押下する。

source: When You Start <application>Accerciser</application>
gl: Cando arrinque <application>Accerciser</application>
ja: <application>Accerciser</application> を起動したら

source: When you start <application>Accerciser</application>, the following window is displayed.
gl: Cando arrinque <application>Accerciser</application>, amosarase a seguinte fiestra.
ja: <application>Accerciser</application> を起動すると、以下のウィンドウが表示されます。

source: <application>Accerciser</application> Main Window
gl: Fiestra Principal de <application>Accerciser</application>
ja: <application>Accerciser</application> メイン・ウィンドウ

source: Shows <placeholder-1/> main window. Contains title bar, menu bar, accessible tree , right plugin display area, and bottom plugin display area. The menu bar contains File, Edit, Bookmarks, View, and Help menus.
gl: Amosa a fiestra principal <placeholder-1/>. Contén a barra de título, a barra de menú, árbore de accesibilidade, área dereita de complementos e área inferior de complementos. A barra de menú contén os menús Ficheiro, Editar, Marcadores, Ver e Axuda.
ja: メイン・ウィンドウを<placeholder-1/>表示します。タイトルバー、メニューバー、ウィジェット・ツリー、右部プラグイン表示エリア、下部プラグイン表示エリアを含みます。メニューバーはファイル、編集、ブックマーク、表示およびヘルプメニューを含みます。

source: The main <application>Accerciser</application> window contains the following elements:
gl: A fiestra principal <application>Accerciser</application> contén os seguintes elementos:
ja: メインの <application>Accerciser</application> ウィンドウには以下の要素が含まれています:

source: Menubar
gl: Barra de menú
ja: メニューバー

source: The menu bar contains commands for managing plugins, managing and using bookmarks, refreshing the accessible tree view, and accessing this help system.
gl: A barra de menú contén ordes para xestionar os complementos, xestionar e empregar os marcadores, actualizar a vista en árbore de accesibilidade, e acceso a este sistema de axuda.
ja: メニューバーから次のことが行えます。プラグインの管理、ブックマークの管理と使用、ウィジェット・ツリー・ビューのリフレッシングおよび本ヘルプ・システムの閲覧。

source: Accessible tree view
gl: Vista de Árbore de Accesibilidade
ja: ウィジェット・ツリー・ビュー

source: The accessible tree view allows to view all of the accessibles starting at the desktop level. Selecting an accessible makes it available for further inspection using the loaded plugins.
gl: A vista de área de accesibilidade permítelle ver todas as accesibles comezando dende o nivel do escritorio. Seleccionando un accesíbel faise dispoñíbel para unha inspección consecuente empregando os complementos cargados.
ja: ウィジェット・ツリー・ビューはデスクトップで起動しているすべてのウィジェットを表示することができます。ウィジェットを選択することで、より詳細な検査のためにロード済みプラグインの使用が可能になります。

source: Right plugin view
gl: Vista dereita de complementos
ja: 右部プラグイン・ビュー

source: This is one of the two default plugin views. When <application>Accerciser</application> is first run, most plugins will reside here. You can drag plugin tabs to the bottom plugin view or to the desktop to show two or more plugins simultaneously.
gl: Esta é unha das dúas vistas de complementos por defecto. Cando <application>Accerciser</application> se executa por primeira vez, a meirande parte dos complementos estarán ahí. Vostede pode arrastrar separadores de complementos á vista inferior de complementos ou ao escritorio para amosar dous ou máis complementos á vez.
ja: これはふたつのデフォルトのプラグイン・ビューのうちのひとつです。<application>Accerciser</application>を起動した時、ほとんどのプラグインはここに配置されています。プラグインのタブを下部プラグイン・ビューかデスクトップにドラッグすることで、同時にふたつ以上のプラグインを表示することができます。

source: Bottom plugin view
gl: Vista inferior de complementos
ja: 下部プラグイン・ビュー

source: You can drag plugins to or from this area just like the right plugin view.
gl: Pode arrastrar complementos dende ou cara esta área como se fora a vista dereita de complementos.
ja: 右部プラグイン・ビューとちょうど同じように、この位置へ、あるいはこの位置からプラグインをドラッグすることができます。

source: Plugin View Management
gl: Xestión de Vistas de Complementos
ja: プラグイン・ビュー管理

source: <application>Accerciser</application> has two modes for viewing plugins. The current view mode could be toggled with <menuchoice><guimenu>View</guimenu><guimenuitem>Single plugin view</guimenuitem></menuchoice> or by pressing <keycombo><keycap>Control</keycap><keycap>t</keycap></keycombo>. When single mode is enabled, all plugins will be put in the top right plugin view and ordered alphabetically, this could be useful for screen reader users who have no use for <application>Accerciser</application>'s flexible plugin spacial layout scheme. When single view mode is disabled plugin tabs could be dragged and dropped in to different plugin views, or could be dragged to the desktop to put the given plugin in a new view. The placement of plugins could also be manipulated with the plugin context menu that could be brought up either from the plugin tab, or the plugin preferences dialog.
gl: Isto pode ser útil para os usuarios de lectores de pantalla que non poidan usar o complemento de esquema de disposición espacial flexíbel do <application>Accerciser</application>. Cando o modo de visualización simple está desactivado os separadores de complementos pódense arrastrar e soltar en diferentes visualizacións de complemento, ou poderíanse arrastrar ao escritorio para pór un complemento determinado nunha visualización nova. A disposición dos complementos pode ser modificada co menú contextual do complemento que pode chamarse tanto dende o separador do complemento como dende o diálogo de preferencias do complemento.
ja: <application>Accerciser</application> はプラグインを表示するふたつのモードがあります。<menuchoice><guimenu>表示</guimenu><guimenuitem>プラグイン固有の表示</guimenuitem></menuchoice>または <keycombo><keycap>Control</keycap><keycap>t</keycap></keycombo> を押下することにより、現在のビュー・モードを切り替えることができます。固有モードが有効になっている場合、すべてのプラグインは右部プラグイン・ビューにアルファベット順に配置されます。これは、<application>Accerciser</application> のプラグインの柔軟な空間的配置を使用しない、スクリーン・リーダのユーザにとって使い勝手が良いでしょう。固有モードが無効になっている場合は、プラグインのタブを別のプラグイン・ビューにドラッグ・アンド・ドロップでき、または新規のビューでプラグインを開くためにデスクトップにドラッグすることもできます。プラグインの配置は、プラグイン・タブから成るプラグイン・コンテキスト・メニューか、またはプラグイン設定画面から操作することができます。

source: Usage
gl: Uso
ja: 使用方法

source: You can use <application>Accerciser</application> to inspect any accessible widget shown in the tree view using the available plugins. The first step is to select an accessible to inspect using one of the following methods: <placeholder-1/>
gl: Pode empregar <application>Accerciser</application> para analizar calquera widget accesíbel que se amosa na vista en árbore empregando os complementos dispoñibles. O primeiro paso é seleccionar un accesíbel para analizalo empregando un dos seguintes métodos: <placeholder-1/>
ja: プラグインを使用し、ツリー・ビューに表示されるアクセス可能なウィジェットを検査するために <application>Accerciser</application> を使用することができます。まずは、以下の手段のひとつを使用して検査するウィジェットを選択してください: <placeholder-1/>

source: Select an accessible through the tree view.
gl: Seleccione un accesíbel a través da vista en árbore
ja: ツリー・ビューを通したウィジェットの選択

source: Use the tree view to navigate the hierarchy of accessible objects rooted at desktop. Unfolding a tree node reveals its immediate children while folding it hides them. Each node shows an icon for its associated application or widget role and its accessible name, if available. The second column lists how many nodes will be shown if the item is unfolded.
gl: Empregue a vista en árbore para navegar a herdanza dos obxectos accesibles que descenden do escritorio. Se desprega os nodos da árbore amosaranse os fillos mentres que se os recolle se agochan. Cada nodo amosa unha icona das asociadas coa aplicación ou rol de widget e o seu nome de accesíbel, se está dispoñíbel. A segunda columna amosa cantos nodos deberían amosarse o elemento está despregado.
ja: デスクトップ上に配置されているアクセス可能なオブジェクトの階層を移動するためにツリー・ビューを使用してください。ツリーのノードを展開するとその直属の子オブジェクトを表示することができ、反対にノードを収縮させると子オブジェクトを隠すことができます。可能であれば、各ノードはアプリケーションやウィジェットの役割に関連するアイコンおよびそのアクセス可能な名前を表示します。二列目は、要素が展開されていれば、いくつのノードが表示可能かを一覧にしています。

source: Using bookmarks
gl: Empregar marcadores
ja: ブックマークの使用

source: Accerciser allows bookmarking selected accessibles for later examining. This could be helpful if the target application must be restarted, for example after rebuilding it. To bookmark the currently selected accessible do <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Add Bookmark...</guimenuitem></menuchoice> or press <keycombo><keycap>Control</keycap><keycap>d</keycap></keycombo>.
gl: Accerciser permite marcar os accesibles selecionados para examilalos máis tarde. Isto pode ser útil se a aplicación destino debe reiniciarse, por exemplo despois de reconstruíla. Para marcar o accesíbel marcado agora mesmo vaia a <menuchoice><guimenu>Marcadores</guimenu><guimenuitem>Engadir marcador...</guimenuitem></menuchoice> ou pulse <keycombo><keycap>Control</keycap><keycap>d</keycap></keycombo>.
ja: Accerciser は、以後の検証のために選択したウィジェットをブックマークすることができます。これは、例えば対象のアプリケーションをリビルドしたりして再起動しなければならないとき等に便利です。現在選択中のウィジェットをブックマークするには次の手順を行ってください。<menuchoice><guimenu>ブックマーク</guimenu><guimenuitem>ブックマークの追加...</guimenuitem></menuchoice>、あるいは<keycombo><keycap>Control</keycap><keycap>d</keycap></keycombo>を押下してください。

source: Bookmarks to accessibles in Accerciser are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state (ie. multiple top level frames) the path might not be correct.
gl: Os marcadores de accesibles en Accerciser definense polo nome dunha aplicación e a "ruta" na herdanza interna na aplicación do accesíbel marcado. Cando unha aplicación destino está nun estado diferente (p.ex. múltiples niveles de marcos principais) a ruta pode non ser a correcta.
ja: Accerciser におけるウィジェットへのブックマークは、アプリケーション名および当該アプリケーション内部のウィジェット階層におけるブックマークされたウィジェットへの"パス"によって定義されています。対象アプリケーションが異なった状態にあれば (つまりトップレベル・フレームが複数ある) 、パスが正しくないのかもしれません。

source: Bookmarks could be managed by accessing the bookmark editing dialog through <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Edit Bookmarks...</guimenuitem></menuchoice>.
gl: Os marcadores poden ser xestionados accedendo ao diálogo de edición de marcadores a traverso de <menuchoice><guimenu>Marcadores</guimenu><guimenuitem>Editar marcador...</guimenuitem></menuchoice>.
ja: ブックマークは次のようにブックマークの編集ダイアログを開くことで管理することができます、<menuchoice><guimenu>ブックマーク</guimenu><guimenuitem>ブックマークの編集...</guimenuitem></menuchoice>。

source: Default Plugins
gl: Complementos por defecto
ja: デフォルトのプラグイン

source: <application>Accerciser</application> comes with several default plugins. These plugins allow you to view a variety of information about the currently selected accessible in the tree view and its neighbors. The default plugins available in 0.1.5 are the following:
gl: <application>Accerciser</application> inclúe algúns complementos por defecto. Estes complementos permiten ver distinta información sobre o accesible seleccionado na vista en árbore e os seus veciños. Os complementos dispoñibles por defecto na versión 0.1.5 son os seguintes:
ja: <application>Accerciser</application> はデフォルトでいくつかのプラグインを備えています。これらのプラグインで、ツリー・ビュー上の現在選択中のウィジェットやその周りのものについていの様々な情報を表示できます。0.1.5 でデフォルトのプラグインは以下の通りです。

source: Interface Viewer
gl: Visor de Interface
ja: インタフェース・ビューア

source: This plugin displays information about the available interfaces for the selected tree view accessible. Unsupported interfaces are grayed out. Various instruments for viewing and controlling an interface are available under each expander.
gl: Este complemento amosa información sobre as interfaces dispoñíbles para o accesíbel seleccionado na vista en árbore. As interfaces non soportadas están escurecidas. Hai dispoñibles distintas ferramentas para ollar e controlar unha interface baixo cada espansor.
ja: このプラグインはツリー・ビューで選択されたウィジェットの利用可能なインタフェースについての情報を表示します。サポートされないインタフェースはグレーアウトされています。展開するとインタフェースを見たり、制御したりするための機能が利用可能になります。

source: Interfaces that are supported by the selected accessible are shown as sensitive.
gl: As interfaces que están soportadas polo accesible seleccionado amosanse como sensíbel.
ja: 選択したウィジェットがサポートするインタフェースは展開可能なものとして表示されます。

source: Event Monitor
gl: Monitor de eventos
ja: イベントの監視

source: This plugin monitors the selected types of events from the selected tree view accessible, from the selected tree view application, or the entire desktop.
gl: Este complemento analiza os tipos de eventos seleccinoados dende a vista accesíbel de árbore seleccionada, dende a fista de aplicacións en árbore seleccionada ou do escritorio enteiro.
ja: このプラグインは、ツリー・ビューで選んだウィジェット、アプリケーション、あるいはデスクトップ全体で発生するイベントのうち選択したイベントを監視します。

source: The bottom part of the event monitor window allows you to pick the type and source of events.
gl: A parte inferior da fiestra de monitorización de eventos permítelle escoller o tipo e fonde dos eventos.
ja: イベントの監視ウィンドウの下部で、監視するイベントのタイプを選択することができます。

source: By pressing <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>l</keycap></keycombo> anywhere on the desktop, the last logged event will be highlighted for later reference. See <xref linkend="accerciser-hotkey-config"/> for how to change this key combination.
gl: Presionando <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>l</keycap></keycombo> en calquera lugar do escritorio, a último evento recollido será resaltado para unha referencia posterior. Vexa <xref linkend="accerciser-hotkey-config"/> para saber como cambiar esta combinación de tecras.
ja: デスクトップ上のどこかで<keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>l</keycap></keycombo>を押下することにより、以降の参照のため、最後に記録されたイベントを強調表示させることができます。このキーの組み合わせを変更するには<xref linkend="accerciser-hotkey-config"/>を参照してください。

source: IPython Console
gl: Consola IPython
ja: IPython コンソール

source: This plugin is a fully-fledged <ulink url="http://ipython.scipy.org/moin/" type="http">IPython</ulink> console. Press <keycap>Tab</keycap> to show completions for the current command. Press <keycap>Enter</keycap> to execute any valid Python code. Commands at the console have access to the currently selected accessible in the accessible tree by way of the <varname>acc</varname> variable. In addition, all functions and constants from the pyatspi package are available as locals in the console. The most important of these are the functions for querying to other accessibility interfaces. For example, to query to the Text interface: <command>t = acc.queryText() </command>. Imports from the current working directory or Python path are also allowed.
gl: Este complemento é unha consola totalmente desenvolta con <ulink url="http://ipython.scipy.org/moin/" type="http">IPython</ulink>. Presione <keycap>Tab</keycap> para amosar completados para o comando actual. Presione <keycap>Enter</keycap> para executar calquera código Python válido. As ordes na consola teñen acceso ao accesíbel seleccionado na árbore de accesibles do xeito da variable <varname>acc</varname>. Ademáis, todalas funcións e constantes do paquete pyatspi están dispoñibles en local na consola. As máis importantes son as funcións de consulta á interface Text: <command>t = acc.queryText() </command>. Aínda que tamén se permite importar dende cartafol de traballo actual ou da ruta de Python.
ja: このプラグインは十分に鍛錬された <ulink url="http://ipython.scipy.org/moin/" type="http">IPython</ulink> コンソールです。現在のコマンドの補完候補をみたければ <keycap>Tab</keycap> を押下してください。 <keycap>Enter</keycap> を押せば、どんな正しい Python コードも実行できます。コンソールのコマンドは、 <varname>acc</varname> 変数をを通じて、ツリーにおける現在選択中のウィジェットにアクセスできます。さらに、 pyatspi パッケージの関数および定数はすべてコンソール・ローカルとして利用可能です。最も重要なものは、他のアクセシビリティ・インタフェースに問い合わせを発行する関数です。例えば、 Text インタフェースに問い合わせるには、<command>t = acc.queryText() </command>と実行してください。作業ディレクトリや Python パスからのインポートも可能です。

source: API Browser
gl: Navegador de API
ja: API ブラウザ

source: This plugin shows the interfaces, methods, and attributes supported by the accessible selected in the tree view.
gl: Este complemento amosa as interfaces, métodos, e atributos que soporta o accesíbel seleccionado na vista en árbore.
ja: このプラグインは、ツリー・ビューで選択されたウィジェットがサポートするインタフェース、メソッド、属性を表示します。

source: The API browser.
gl: O navegador de API.
ja: API ブラウザ

source: Script recorder
gl: Gravador de Script
ja: スクリプトの記録

source: <application>Accerciser</application>'s script recorder allows users to record keyboard interaction with other desktop applications for the purpose of authoring UI test scripts. Currently the plug-in supports the generation of scripts for three platforms: Dogtail, LDTP, and an Accerciser's built-in API. Once you press the "Record" button every keyboard interaction will be recorded in to a script that could be executed later as a stand alone script.
gl: Os gravar guións de <application>Accerciser</application> permite aos usuarios gravar as interacións co teclado coas aplicaións de escritorio para poder deste xeito crear guións de proba de Interface de Usuario. Actualmente o complemento soporta a xeración de guións para as tres plataformas: Dogtail, LDTP e a API interna de Accercise. Unha vez que presione o botón "Gravar" cada interación de teclado será gravada no guión e pode ser executada máis tarde como un script propio.
ja: <application>Accerciser</application>のスクリプト・レコーダは、UI テスト・スクリプトを書く目的で、ユーザが他のデスクトップアプリケーションに対するキーボード操作を記録することができます。現在プラグインは次のみっつのプラットフォームのスクリプトの世代をサポートします。すなわち、Dogtail、LDTP および Accerciser ビルトイン API。一度 "録音" ボタンを押すとあらゆるキーボード操作がスクリプトに記録され、そのスクリプトは後にスタンド・アロン・スクリプトとして実行可能です。

source: Script Recorder
gl: Gravador de Script
ja: スクリプトの記録

source: The script recorder.
gl: O gravador de script.
ja: スクリプトの記録

source: Quick select
gl: Selección rápida
ja: クイック・セレクト

source: This plugin provides global hotkeys for allowing quick selection of accessibles through the target application's UI. Pressing <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>a</keycap></keycombo> will select the last focused widget's accessible in <application>Accerciser</application>. Pressing <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>t</keycap></keycombo> will select the accessible of the widget that is under the pointer.
gl: Este complemento fornece atallos de teclado globais que permiten a selección rápida dos accesibles a trav'es da interface de usuario do aplicativo. Presionando <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>a</keycap></keycombo> seleccionarase o último widget accesíbel que tivo o foco por última vez no <application>Accerciser</application>. Ao premer <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>t</keycap></keycombo> seleccionarase o accesíbel do widget que está debaixo do punteiro de rato.
ja: このプラグインは、対象のアプリケーションの UI を通した、ウィジェットの迅速な選択を可能にするグローバルなホットキーを提供します。 <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>a</keycap></keycombo> を押下すれば、 <application>Accerciser</application> でアクセス可能な、最後にフォーカスを持ったウィジェットを選択するでしょう。 <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>t</keycap></keycombo> を押下すれば、ポインタの下にあるウィジェットを選択するでしょう。

source: Validation
gl: Validación
ja: 検証
