Repository: GNOME/accerciser
Catalog: po/*.po
Languages: az, en@shaw, ne

source: To run the API Browser Plugin, select an accessible widget in the Application Tree View. Double-clicking a widget highlights it in the application's interface, so you can be sure whether a certain widget were the one you were looking for.
ne: एपीआई ब्राउजर प्लगइन चलाउन, अनुप्रयोग ट्री दृश्यमा पहुँच योग्य विजेट चयन गर्नुहोस् । एक विजेट डबल-क्लिक गर्दा यसलाई अनुप्रयोगको इन्टरफेसमा हाइलाइट गर्दछ, त्यसैले तपाईं निश्चित हुन सक्नुहुनेछ कि निश्चित विजेट तपाईले खोज्नुभएको थियो।.

source: After that, select one of the widget's interfaces in the combobox. All public methods of the selected interface will be listed in the plugin's leftmost column. All public properties, with their corresponding values, will be listed in the plugin's rightmost column.
ne: त्यसपछि, कम्बोबक्समा विजेटको इन्टरफेसमध्ये एउटा चयन गर्नुहोस् । चयन गरिएको इन्टरफेसका सबै सार्वजनिक विधिहरू प्लगइनको बायाँ स्तम्भमा सूचीबद्ध गरिनेछ। सबै सार्वजनिक गुणहरू, उनीहरूको सम्बन्धित मानहरूसँग, प्लगइनको दायाँ स्तम्भमा सूचीबद्ध गरिनेछ।.

source: By default, the API Browser Plugin hides private methods and properties. To see them listed, unselect the checkbox <cmd>Hide Private Attributes</cmd>. To hide them again, re-select this checkbox.
ne: पूर्वनिर्धारित रूपमा, एपीआई ब्राउजर प्लगइनले निजी विधिहरू र गुणहरू लुकाउँदछ। तिनीहरूलाई सूचीबद्ध हेर्नका लागि, <cmd>निजी विशेषताहरू लुकाउनुहोस्</cmd> चेकबाकस चयन नगर्नुहोस् । तिनीहरूलाई फेरि लुकाउन, यो चेकबाकस पुन: चयन गर्नुहोस् ।.

# sort
source: 1. Application Tree View
ne: १. अनुप्रयोग ट्री दृश्य

source: Exploring the accessible hierarchy of the desktop
ne: डेस्कटपको पहुँच योग्य पदानुक्रम खोजी गर्दैछ

source: Application Tree View
ne: अनुप्रयोग ट्री दृश्य

source: <app>Accerciser</app>'s interface contains a tree view, namely Application Tree View, that covers all accessible applications currently running on the desktop. To create this tree view, <app>Accerciser</app> uses the AT-SPI's registry daemon. This daemon is responsible for keeping track of all the accessible applications on the desktop and forwarding X events over the AT-SPI D-Bus. After getting all accessible applications, <app>Accerciser</app> represents each one of them as a hierarchical structure with expanding nodes.
ne: <app>एक्सरसिजरको</app> इन्टरफेसले ट्री भ्यू, अर्थात् एप्लिकेशन ट्री भ्यू समावेश गर्दछ, जसले हाल डेस्कटपमा चलिरहेको सबै पहुँच योग्य अनुप्रयोगहरू समावेश गर्दछ। यो ट्री दृश्य सिर्जना गर्न, <app>एकसेरसिजरले</app> एटी-एसपीआईको रजिस्ट्री डेमन प्रयोग गर्दछ। यो डेमन डेस्कटपमा सबै पहुँच योग्य अनुप्रयोगहरूको ट्र्याक राख्न र एटी-एसपीआई डी-बसमा एक्स घटनाहरू अग्रेषित गर्न जिम्मेवार छ। सबै पहुँच योग्य अनुप्रयोगहरू प्राप्त गरेपछि, <app>एक्सरसिजरले</app> ती मध्ये प्रत्येकलाई विस्तारित नोड्सको साथ पदानुक्रमित संरचनाको रूपमा प्रतिनिधित्व गर्दछ।.

source: <app>Accerciser</app>'s Application Tree View represents the interface of each accessible application running on the desktop as a widget hierarchical structure.
ne: <app>एक्सरसिजरको</app> अनुप्रयोग ट्री दृश्यले डेस्कटपमा चलिरहेको प्रत्येक पहुँच योग्य अनुप्रयोगको इन्टरफेसलाई विजेट पदानुक्रमित संरचनाको रूपमा प्रतिनिधित्व गर्दछ।.

# _
source: external ref='figures/tree_view_accerciser.png' md5='594e06b7889eff705ac194656939e146'
ne: बाह्य रेफरी ='आंकड़े/tree_view_accerciser.png' एमडी 5 ='594ई06बी7889एफएफ705एसी19466939ई146'

source: The first node of each application represented in this tree view is the application itself. When you expand a node, you can see all of its child widgets, which allows a hierarchical view of the application's interface. For each node, <app>Accerciser</app> provides some basic information, such as its name, role and number of children.
ne: यस ट्री दृश्यमा प्रतिनिधित्व गरिएको प्रत्येक अनुप्रयोगको पहिलो नोड अनुप्रयोग नै हो। जब तपाईं नोड विस्तार गर्नुहुन्छ, तपाईं यसको सबै चाइल्ड विजेटहरू देख्न सक्नुहुन्छ, जसले अनुप्रयोगको इन्टरफेसको पदानुक्रमित दृश्यलाई अनुमति दिन्छ। प्रत्येक नोडको लागि, <app>एक्सरसिजरले</app> केही आधारभूत जानकारी प्रदान गर्दछ, जस्तै यसको नाम, भूमिका र बच्चाहरूको संख्या।.

source: Be aware that nodes with many children take a long time to expand.
ne: धेरै बच्चाहरूसँग नोडहरू विस्तार गर्न लामो समय लाग्छ भनेर सचेत हुनुहोस्।.

source: Bookmarking items in the Application Tree View
ne: अनुप्रयोग ट्री दृश्यमा पुस्तकचिनो लगाउने वस्तुहरू

source: <app>Accerciser</app> allows bookmarking items in the Application Tree View for later examining. This is helpful when the target application must be restarted - after rebuilding it, for example. To bookmark an item, select it and do <guiseq><gui>Bookmarks</gui><gui>Add Bookmark</gui></guiseq> or press <keyseq><key>Ctrl</key><key>d</key></keyseq>.
ne: <app>एक्सरसिजरले</app> अनुप्रयोग ट्री दृश्यमा पछि जाँचको लागि वस्तुहरू बुकमार्क गर्न अनुमति दिन्छ। उदाहरणका लागि, यसलाई पुनर्निर्माण गरेपछि - लक्ष्य अनुप्रयोग पुन: सुरु गर्दा यो उपयोगी हुन्छ। वस्तु बुकमार्क गर्न, यसलाई चयन गर्नुहोस् र <guiseq><gui>बुकमार्क</gui><gui>गर्नुहोस् बुकमार्क थप्नुहोस्</gui></guiseq> वा <keyseq><key>Ctrl</key><key>d थिच्नुहोस्</key></keyseq>।.

source: Bookmarks to accessible items in <app>Accerciser</app> are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state - i.e. multiple top level frames -, the path might not be correct. Bookmarks could be managed by accessing the bookmark editing dialog through <guiseq><gui>Bookmarks</gui><gui>Edit Bookmarks</gui></guiseq>.
ne: <app>एक्सरसिजरमा</app> पहुँच योग्य वस्तुहरूमा पुस्तकचिनोहरू अनुप्रयोग नाम र अनुप्रयोगको आन्तरिक पहुँचयोग्य पदानुक्रममा बुकमार्क गरिएको पहुँचयोग्यमा "बाटो" द्वारा परिभाषित गरिन्छ। जब लक्ष्य अनुप्रयोग फरक अवस्थामा हुन्छ - अर्थात् एकाधिक शीर्ष स्तर फ्रेमहरू - , बाटो सही नहुन सक्छ। पुस्तकचिनो सम्पादन संवादमा पहुँच गरेर पुस्तकचिनोहरू सम्पादन <guiseq><gui>गर्नुहोस् पुस्तकचिनोहरू</gui> व्यवस्थापन <gui>गर्न</gui></guiseq> सकिन्छ ।.

# sort
source: 4. Event Monitor Plugin
ne: ४. घटना मनिटर प्लगइन

source: Monitoring accessible events as they occur
ne: पहुँच योग्य घटनाहरू घटित हुँदा निगरानी गर्दै

source: Event Monitor Plugin
ne: घटना मोनिटर प्लगइन

source: The Event Monitor Plugin allows you to view <link href="http://accessibility.linuxfoundation.org/a11yspecs/atspi/adoc/atspi-events.html">AT-SPI events</link> as they occur on the applications exposed in <app>Accerciser</app>'s <link xref="desktop_tree_view">Application Tree View</link>. The plugin is useful to explore the dynamics of an application's interface and verify which accessible widgets are related to which AT-SPI events.
ne: इभेन्ट मोनिटर प्लगइनले तपाईंलाई <ink href= "http://accessibility.linuxfoundation.org/a11yspecs/atspi/adoc/atspi-events.html" >एटी-एसपीआई घटनाहरू हेर्न अनुमति दिन्छ</link> किनकि तिनीहरू <app>एक्सरसिजरको</app> <link xref="desktop_tree_view">एप्लिकेसन ट्री भ्यूमा उजागर गरिएका अनुप्रयोगहरूमा हुन्छन्</link>। प्लगइन अनुप्रयोगको इन्टरफेसको गतिशीलता अन्वेषण गर्न र कुन पहुँच योग्य विजेटहरू कुन एटी-एसपीआई घटनाहरूसँग सम्बन्धित छन् भनेर प्रमाणित गर्न उपयोगी छ।.

source: The Event Monitor Plugin allows you to view AT-SPI events and match them with accessible widgets.
ne: इभेन्ट मोनिटर प्लगइनले तपाईंलाई एटी-एसपीआई घटनाहरू हेर्न र पहुँच योग्य विजेटहरूसँग मिलान गर्न अनुमति दिन्छ।.

# _
source: external ref='figures/event_monitor_plugin.png' md5='d4433124f4833aa7322c7a6ec0b21104'
ne: बाह्य रेफरी = 'आंकड़े / event_monitor_plugin.png' एमडी 5 = 'डी 4433124 एफ 4833 एए 7322 सी 7 ए 6 ईसीई 0 बी 21104'

source: Running the Event Monitor Plugin
ne: इभेन्ट मनिटर प्लगइन चलाउँदैछ

source: When you open the Event Monitor Plugin, you see a list of checkboxes representing all the different AT-SPI event classes covered by the plugin:
ne: जब तपाईं इभेन्ट मनिटर प्लगइन खोल्नुहुन्छ, तपाईँले प्लगइनले ढाकेका सबै फरक एटी-एसपीआई घटना वर्गहरूको प्रतिनिधित्व गर्ने चेकबक्सहरूको सूची देख्नुहुन्छ:

source: document
ne: कागजात

source: focus
ne: संकेन्द्रविन्दु

source: mouse
ne: माउस

source: object
ne: वस्तु

source: terminal
ne: टर्मिनल

source: window
ne: सञ्झ्याल

source: If you check a class, all of its event types will be monitored by the plugin. The classes are exposed as tree structures; therefore, you can refine your selection by expanding them and checking only the event types you really care about.
ne: यदि तपाईँले एउटा वर्ग जाँच गर्नुभयो भने, यसका सबै घटना प्रकारहरू प्लगइनद्वारा निगरानी गरिनेछ। वर्गहरू रूख संरचनाहरूको रूपमा उजागर हुन्छन्; यसैले, तपाईं तिनीहरूलाई विस्तार गरेर र केवल घटना प्रकारहरू जाँच गरेर तपाईंको चयनलाई परिष्कृत गर्न सक्नुहुन्छ जुन तपाईं वास्तवमा ख्याल राख्नुहुन्छ।.

source: If you want to monitor all possible types of AT-SPI events, press the <cmd>Select All</cmd> button. Similarly, if you want to clear all currently selected event types, press the <cmd>Clear Selection</cmd> button.
ne: यदि तपाईं सबै सम्भावित प्रकारका एटी-एसपीआई घटनाहरू अनुगमन गर्न चाहनुहुन्छ भने, <cmd>सबै चयन गर्नुहोस् बटन थिच्नुहोस्</cmd>। त्यस्तै, यदि तपाईँ हालै चयन गरिएका सबै घटना प्रकारहरू खाली गर्न चाहनुहुन्छ भने, <cmd>चयन खाली गर्नुहोस् बटन थिच्नुहोस्</cmd>।

source: Selecting only a few event types per monitoring gives you a clearer output.
ne: प्रति निगरानी केही घटना प्रकारहरू मात्र चयन गर्दा तपाईंलाई स्पष्ट आउटपुट दिन्छ।.

source: Another way to refine event monitoring is by the event source. By default, the Source option <cmd>Everything</cmd> is selected, indicating that AT-SPI events of all applications will be monitored. If you want to investigate a single application, select it in the Application Tree View and click the Source radio button <cmd>Selected application</cmd>. Likewise, if you want to monitor a single accessible widget and its corresponding descendants, select it in the Application Tree View and click the Source radio button <cmd>Selected accessible</cmd>.
ne: घटना अनुगमन परिष्कृत गर्न अर्को तरिका घटना स्रोत द्वारा हो। पूर्वनिर्धारित रूपमा, स्रोत विकल्प<cmd> सबै कुरा</cmd> चयन गरिएको छ, सबै अनुप्रयोगहरूको AT-SPI घटनाहरू निगरानी गरिनेछ भनेर संकेत गर्दै। यदि तपाइँ एकल अनुप्रयोगको खोजी गर्न चाहनुहुन्छ भने, यसलाई अनुप्रयोग ट्री दृश्यमा चयन गर्नुहोस् र स्रोत रेडियो बटनमा क्लिक गर्नुहोस्<cmd> चयन गरिएको आवेदन</cmd> । त्यसै गरी, यदि तपाइँ एकल पहुँचयोग्य विजेट र यसको सम्बन्धित वंशजहरू निगरानी गर्न चाहनुहुन्छ भने, यसलाई अनुप्रयोग ट्री दृश्यमा चयन गर्नुहोस् र स्रोत रेडियो बटनमा क्लिक गर्नुहोस्।<cmd> पहुँचयोग्य चयन गरियो</cmd> ।.

source: After selecting event types and specifying a Source option, the Event Monitor Plugin starts monitoring AT-SPI events automatically, because the <cmd>Monitor Events</cmd> button is pressed by default. Whenever you want to stop monitoring, click the <cmd>Monitor Events</cmd> button. To restart monitoring, press this button again.
ne: घटना प्रकारहरू चयन गरेपछि र स्रोत विकल्प निर्दिष्ट गरेपछि, घटना मनिटर प्लगइनले AT-SPI घटनाहरू स्वचालित रूपमा निगरानी गर्न थाल्छ, किनभने<cmd> घटनाहरू निगरानी गर्नुहोस्</cmd> बटन पूर्वनिर्धारित रूपमा थिचिएको छ। जब तपाइँ अनुगमन रोक्न चाहानुहुन्छ, क्लिक गर्नुहोस्<cmd> घटनाहरू निगरानी गर्नुहोस्</cmd> टांक। अनुगमन पुन: सुरु गर्न, यो बटन फेरि थिच्नुहोस्।.

source: For each incoming event, the Event Monitor Plugin indicates the source and the application. Activating the link for either of these items will cause it to become selected in the Application Tree View.
ne: प्रत्येक आगमन घटनाको लागि, घटना मनिटर प्लगइनले स्रोत र अनुप्रयोगलाई संकेत गर्दछ। यी मध्ये कुनै पनि वस्तुको लागि लिङ्क सक्रिय गर्नाले यसलाई एप्लिकेसन ट्री दृश्यमा चयन गर्न सकिन्छ।.

source: If you want to save the output generated by the Event Monitor Plugin, just press the <cmd>Save</cmd> button. To clear the output screen, you just need to click the <cmd>Clear</cmd> button.
ne: यदि तपाइँ घटना मनिटर प्लगइन द्वारा उत्पन्न आउटपुट बचत गर्न चाहनुहुन्छ भने, केवल थिच्नुहोस्<cmd> बचत गर्नुहोस्</cmd> टांक। आउटपुट स्क्रिन खाली गर्न, तपाईंले मात्र क्लिक गर्न आवश्यक छ<cmd> खाली गर्नुहोस्</cmd> टांक।.

# sort
source: 2. How to install and run <app>Accerciser</app>
ne: १. <app>एक्सरसिजर</app> कसरी स्थापना र चलाउने

# link
source: Setting up <app>Accerciser</app>
ne: <app>एकरसिजर </app>सेटअप गर्दैछ

source: Installing and running <app>Accerciser</app> on your system
ne: तपाईँको प्रणालीमा <app>एक्सरसिजर</app> स्थापना र चलिरहेको छ

source: Setting up <app>Accerciser</app>
ne: <app>एकरसिजर </app>सेटअप गर्दैछ

source: Check if your distribution has <app>Accerciser</app> already packaged. If this is the case, you can install it via its package manager. Otherwise, you can follow the section below to install <app>Accerciser</app> manually.
ne: तपाईँको वितरणमा पहिल्यै प्याक गरिएको <app>एक्सर्साइजर</app> छ कि छैन जाँच गर्नुहोस् । यदि यो मामला हो भने, तपाईं यसलाई यसको प्याकेज प्रबन्धक मार्फत स्थापना गर्न सक्नुहुनेछ। अन्यथा, तपाईं म्यानुअल रूपमा <app>एक्सर्साइजर</app> स्थापना गर्न तलको खण्ड पछ्याउन सक्नुहुन्छ।.

source: Installing <app>Accerciser</app> manually
ne: म्यानुअल रूपमा <app>एकरसिजर</app> स्थापना गर्दै

source: To install <app>Accerciser</app> manually, you will need to download it first. <app>Accerciser</app>'s source code can either be downloaded from <link href="http://ftp.gnome.org/pub/GNOME/sources/accerciser/">the gnome.org FTP site</link> or cloned from <link href="https://gitlab.gnome.org/GNOME/accerciser">the gnome.org GIT repository</link>.
ne: म्यानुअल रूपमा <app>एक्सर्साइजर</app> स्थापना गर्न, तपाईंले यसलाई पहिले डाउनलोड गर्न आवश्यक पर्दछ। <app>एक्सरसिजरको</app> स्रोत कोड या त <link href="http://ftp.gnome.org/pub/GNOME/sources/accerciser/" > gnome.org एफटीपी साइटबाट डाउनलोड गर्न सकिन्छ</link> वा <link href="https://gitlab.gnome.org/GNOME/accerciser" > gnome.org जीआईटी भण्डारबाट क्लोन गर्न सकिन्छ</link>।.

source: If you are not using GNOME 3, you may find that <app>Accerciser</app> version 3 or later is not compatible with your environment.
ne: यदि तपाईंले GNOME 3 प्रयोग गरिरहनु भएको छैन भने, तपाईंले त्यो फेला पार्न सक्नुहुन्छ<app> Accerciser</app> संस्करण 3 वा पछिको तपाईंको वातावरणसँग उपयुक्त छैन।.

source: After getting <app>Accerciser</app>, install it using the following commands:
ne: <app>एक्सरसिजर</app> प्राप्त गरेपछि, यसलाई निम्न आदेशहरू प्रयोग गरेर स्थापना गर्नुहोस्:

source: <cmd>meson setup _build .</cmd>
ne: <cmd>मेसन सेटअप बिल्ड।</cmd>

source: <cmd>meson compile -C _build</cmd>
ne: <cmd>मेसन कम्पाइल -सी बिल्ड</cmd>

source: <cmd>sudo meson install -C _build # or meson install -C _build as root</cmd>
ne: <cmd>सुडो मेसन स्थापना -सी बिल्ड # वा मेसन स्थापना -सी रूटको रूपमा निर्माण</cmd> गर्नुहोस्

source: Running <app>Accerciser</app>
ne: <app>एक्सरसिजर</app> चलिरहेको छ

# sort
source: 3. Writing New Plugins
ne: ३. नयाँ प्लगइन्स लेख्नु

source: Extending <app>Accerciser</app> with your desired functionalities
ne: तपाईँको इच्छित कार्यक्षमताका साथ <app>एक्सरसिजर</app> विस्तार गर्दै

source: Writing Plugins for <app>Accerciser</app>
ne: <app>एक्सरसिजरका</app> लागि प्लगइन हरू लेख्दैछ

source: <app>Accerciser</app> supports three basic types of plugins:
ne: <app>एक्सरसिजरले</app> तीन आधारभूत प्रकारका प्लगइनहरू समर्थन गर्दछ:

source: Console plugins - These plugins provide simple console output into a text area in a plugin tab. Not to be confused with the packaged <link xref="ipython_plugin">IPython Console Plugin</link>.
ne: कन्सोल प्लगइन्स - यी प्लगइनहरूले प्लगइन ट्याबमा पाठ क्षेत्रमा सरल कन्सोल आउटपुट प्रदान गर्दछ। प्याक गरिएको <link xref="ipython_plugin">आईपीथन कन्सोल प्लगइन</link> सँग भ्रमित नहुनुहोस्।

source: Creating a Base Plugin
ne: आधार प्लगइन सिर्जना गर्दैछ

source: First off, the import lines we will use are:
ne: पहिलो बन्द, हामीले प्रयोग गर्ने आयात लाइनहरू हुन्:

source: We will now override the init method, in which we will set a global key action for selecting the last focused accessible item, register an event listener for the "focus" event, and set the <cmd>last_focused</cmd> instance variable to <cmd>None</cmd>.
ne: अब हामी इनिट विधिलाई ओभरराइड गर्नेछौं, जसमा हामी अन्तिम फोकस पहुँच योग्य वस्तु चयन गर्नका लागि विश्वव्यापी कुञ्जी कार्य सेट गर्नेछौं, "फोकस" घटनाका लागि घटना श्रोता दर्ता गर्नेछौं, र <cmd>अन्तिम फोकस गरिएको</cmd> उदाहरण चरलाई <cmd>कुनै मा सेट गर्नेछैनौं</cmd>।

source: Creating a Console Plugin
ne: कन्सोल प्लगइन सिर्जना गर्दै

source: The needed import lines are:
ne: आवश्यक आयात लाइनहरू हुन्:

source: Then we add a class definition, with a plugin name and description:
ne: त्यसपछि हामी प्लगइन नाम र वर्णनको साथ एक वर्ग परिभाषा थप्छौं:

source: Creating a Viewport Plugin
ne: दृश्यपोर्ट प्लगइन सिर्जना गर्दैछ

source: We will create a viewport plugin that allows quick testing of the "click" action in accessible items that support the AT-SPI Action interface and have an action named "click". It will be a simple button that, once clicked, does the "click" action in the accessible.
ne: हामी एक भ्यूपोर्ट प्लगइन सिर्जना गर्नेछौं जसले एटी-एसपीआई एक्शन इन्टरफेससमर्थन गर्ने पहुँचयोग्य वस्तुहरूमा "क्लिक" कार्यको द्रुत परीक्षण गर्न अनुमति दिन्छ र "क्लिक" नामक कार्य छ। यो एक साधारण बटन हुनेछ जुन, एक पटक क्लिक गरेपछि, पहुँच योग्यमा "क्लिक" कार्य गर्दछ।

source: First off, some mandatory import lines:
ne: पहिलो बन्द, केही अनिवार्य आयात लाइनहरू:

source: Next, a class definition, with a name and description:
ne: अर्को, एक वर्ग परिभाषा, एक नाम र वर्णन संग:

# text
source: Accerciser
ne: एकरसिजर

# link
source: Introduction to <app>Accerciser</app>
ne: <app>एक्सर्सिसरको</app> परिचय

source: <app>Accerciser</app>'s logo
ne: <app>एक्सरसिजरको</app> लोगो

source: <_:media-1/> <app>Accerciser</app>
ne: <_:media-1/> <app>एक्सरसिजरको</app>

source: Before You Begin
ne: सुरु गर्नुअघि

source: Read the <link xref="help:gnome-help/a11y">Universal Access Help</link>
ne: <link xref="help:gnome-help/a11y">युनिभर्सल पहुँच मद्दत</link> पढ्नुहोस्

source: Getting Started
ne: सुरु आत गर्दै

source: Examining the Accessibility of an Application
ne: अनुप्रयोगको पहुँच जाँच गर्दै

source: Advanced Topics
ne: उन्नत विषयहरू

# sort
source: 2. Interface Viewer Plugin
ne: २. इन्टरफेस हेर्ने प्लगइन

source: Examining your accessibility implementation
ne: तपाईँको पहुँच कार्यान्वयन जाँच गर्दैछ

source: Interface Viewer Plugin
ne: इन्टरफेस हेर्ने प्लगइन

source: Examining a Menu with the Interface Viewer Plugin
ne: इन्टरफेस दर्शक प्लगइनसँग मेनु जाँच गर्दैछ

source: Given a selected item in the Application Tree View, all of its AT-SPI interfaces will be shown as sensitive in the Interface Viewer Plugin. Those unsupported will appear grayed out, such as the Application and Collection interfaces in the figure above.
ne: अनुप्रयोग ट्री दृश्यमा चयन गरिएको वस्तु दिइएको छ, यसको सबै एटी-एसपीआई इन्टरफेसहरू इन्टरफेस दर्शक प्लगइनमा संवेदनशील रूपमा देखाइनेछ। ती असमर्थितहरू ग्रे आउट देखा पर्नेछन्, जस्तै माथिको आकृतिमा अनुप्रयोग र संग्रह इन्टरफेसहरू।

source: Running the Interface Viewer Plugin
ne: इन्टरफेस दर्शक प्लगइन चलिरहेको छ

source: Accessible - This interface shows the selected item's child count (number of child widgets), description, states, relations, and attributes.
ne: पहुँचयोग्य - यो इन्टरफेसले चयन गरिएको वस्तुको बाल गणना (बाल विजेटको सङ्ख्या), वर्णन, अवस्था, सम्बन्ध र विशेषताहरू देखाउँदछ ।

source: Action - This interface shows all the actions that can be performed by the selected item. For each interface, you will see its name, such as "press" or "click", followed by a description and a key binding, if there are any. If you select an action, a "Perform action" button will become sensitive. Press this button to see the item performing the selected action.
ne: कार्य - यो इन्टरफेसले चयन गरिएको वस्तुद्वारा प्रदर्शन गर्न सकिने सबै कार्यहरू देखाउँदछ । प्रत्येक इन्टरफेसको लागि, तपाईंले यसको नाम देख्नुहुनेछ, जस्तै "थिच्नुहोस्" वा "क्लिक गर्नुहोस्", त्यसपछि वर्णन र कुञ्जी बाइन्डिङ, यदि त्यहाँ कुनै छ भने। यदि तपाईँले कार्य चयन गर्नुभयो भने, "कार्य सम्पादन गर्नुहोस्" बटन संवेदनशील हुनेछ । चयन गरिएको कार्य सम्पादन गर्ने वस्तु हेर्न यो बटन थिच्नुहोस् ।

source: Application - This interface can be implemented by items with role "application". It is worth to point out that items with role "application" not necessarily implement this interface. If the selected item implements it, the interface will show its ID and, if there are any, its toolkit and version.
ne: अनुप्रयोग - यो इन्टरफेस भूमिका "अनुप्रयोग" को साथ वस्तुहरू द्वारा कार्यान्वयन गर्न सकिन्छ। यो भूमिका "अनुप्रयोग" को साथ वस्तुहरू यो इन्टरफेस लागू गर्न आवश्यक छैन भनेर औंल्याउन लायक छ। यदि चयन गरिएको वस्तुले यसलाई कार्यान्वयन गर्दछ भने, इन्टरफेसले यसको आईडी देखाउनेछ र यदि त्यहाँ कुनै छ भने, यसको टूलकिट र संस्करण।

source: Component - This interface shows the selected item's absolute position (with respect to the desktop coordinate system), relative position (with respect to the window coordinate system), size, layer type, MDI-Z-order (a short integer indicating the stacking order of the component in the MDI layer), and alpha (if alpha blending is used).
ne: कम्पोनेन्ट - यो इन्टरफेसले चयन गरिएको वस्तुको निरपेक्ष स्थिति (डेस्कटप समन्वय प्रणालीको सन्दर्भमा), सापेक्ष स्थिति (सञ्झ्याल समन्वय प्रणालीको सम्बन्धमा), साइज, तह प्रकार, एमडीआई-जेड-अर्डर (एमडीआई तहमा घटकको स्ट्याकिंग क्रम संकेत गर्ने छोटो पूर्णांक), र अल्फा (यदि अल्फा सम्मिश्रण प्रयोग गरिएको छ भने) देखाउँछ।

source: Document - This interface shows the selected item's document attributes and locale description, if there is one.
ne: कागजात - यो इन्टरफेसले चयन गरिएको वस्तुको कागजात विशेषताहरू र लोकेल वर्णन देखाउँदछ, यदि त्यहाँ एक छ भने।

source: Hypertext - This interface shows a list with all the selected item's hypertext hyperlinks. For each hyperlink, the interface provides its name, URI, start (the index in the hypertext at which the hyperlink begins) and end (the index in the hypertext at which this hyperlink ends).
ne: हाइपरटेक्स्ट - यो इन्टरफेसले सबै चयन गरिएका वस्तुको हाइपरटेक्स्ट हाइपरलिङ्कहरूको सूची देखाउँदछ । प्रत्येक हाइपरलिङ्कका लागि, इन्टरफेसले यसको नाम, यूआरआई, स्टार्ट (हाइपरटेक्स्टमा अनुक्रमणिका जसमा हाइपरलिङ्क सुरु हुन्छ) र अन्त्य (हाइपरटेक्स्टमा अनुक्रमणिका जसमा यो हाइपरलिङ्क समाप्त हुन्छ) प्रदान गर्दछ।

source: Image - This interface shows the selected item's description (or "no description" if unspecified), size, position (with respect to the desktop coordinate system), and locale, if there is one.
ne: छवि - यो इन्टरफेसले चयन गरिएको वस्तुको वर्णन (वा निर्दिष्ट नगरेमा "वर्णन छैन"), साइज, स्थिति (डेस्कटप समन्वय प्रणालीको सन्दर्भमा), र लोकेल देखाउँदछ, यदि त्यहाँ एक छ भने।

source: Selection - This interface shows all selectable child items of the selected item. If the selected item is a menu bar with options "File", "Edit", "View", and "Help", and all of them are selectable, then they will be listed in this interface. If you click a listed option - "File", for example - and want to clear it, just press the "Clear" button below the list.
ne: चयन - यो इन्टरफेसले चयन गरिएको वस्तुका सबै चयन योग्य चाइल्ड वस्तुहरू देखाउँदछ । यदि चयन गरिएको वस्तु "फाइल", "सम्पादन", "दृश्य", र "मद्दत" विकल्पहरूको साथ मेनु पट्टी हो, र ती सबै चयन योग्य छन् भने, तिनीहरू यस इन्टरफेसमा सूचीबद्ध हुनेछन्। यदि तपाईं सूचीबद्ध विकल्प क्लिक गर्नुहुन्छ - "फाइल", उदाहरणका लागि - र यसलाई खाली गर्न चाहानुहुन्छ भने, सूचीको तल "खाली गर्नुहोस्" बटन थिच्नुहोस्।

source: Streamable Content - This interface shows the selected item's content types and their corresponding URIs.
ne: स्ट्रिम गर्न सकिने सामग्री - यो इन्टरफेसले चयन गरिएको वस्तुको सामग्री प्रकार र तिनीहरूको सम्बन्धित यूआरआई हरू देखाउँदछ।

source: Table - This interface shows the selected item's caption and summary, rows (number of rows), columns (number of columns), selected rows (number of selected rows), and selected columns (number of selected columns). For a selected cell, the interface shows its row's and column's header and extents.
ne: तालिका - यो इन्टरफेसले चयन गरिएको वस्तुको क्याप्सन र सारांश, पङ्क्तिहरू (पङ्क्तिहरूको सङ्ख्या), स्तम्भहरू (स्तम्भहरूको सङ्ख्या), चयन गरिएका पङ्क्तिहरू (चयन गरिएका पङ्क्तिहरूको सङ्ख्या), र चयन गरिएका स्तम्भहरू (चयन गरिएका स्तम्भहरूको सङ्ख्या) देखाउँदछ । चयन गरिएको कक्षका लागि, इन्टरफेसले यसको पङ्क्ति र स्तम्भको हेडर र विस्तार हरू देखाउँदछ ।
