Repository: GNOME/accerciser
Catalog: po/*.po
Languages: az, en@shaw, ne

source: TableCell - This interface shows the selected item's row and column index, row and column span, a list of the row and column header cells and the cell's table. By selecting a header cell in the list of row or column headers and pressing the "Show" button, it's possible to select that header cell object in Accerciser instead. Pressing the table button causes the table object to be selected.
ne: तालिकासेल - यो इन्टरफेसले चयन गरिएको वस्तुको पङ्क्ति र स्तम्भ अनुक्रमणिका, पङ्क्ति र स्तम्भ विस्तार, पङ्क्ति र स्तम्भ हेडर कक्षहरूको सूची र कक्षको तालिका देखाउँदछ । पङ्क्ति वा स्तम्भ हेडरको सूचीमा हेडर कक्ष चयन गरेर र "देखाउनुहोस्" बटन थिचेर, यसको सट्टामा एक्सरसिजरमा हेडर सेल वस्तु चयन गर्न सम्भव छ। तालिका बटन थिच्दा तालिका वस्तु चयन हुन्छ ।

source: Text - This interface shows the selected item's text content, that can be editable, and its attributes. The basic attributes are offset (the number of characters the text has) and justification. To see possible CSS attributes, click the "Include defaults" check box.
ne: पाठ - यो इन्टरफेसले चयन गरिएको वस्तुको पाठ सामग्री, जुन सम्पादन योग्य हुन सक्छ, र यसको विशेषताहरू देखाउँदछ। आधारभूत विशेषताहरू अफसेट (पाठमा भएका क्यारेक्टरहरूको संख्या) र औचित्य हुन्। सम्भावित सीएसएस विशेषताहरू हेर्नका लागि, "पूर्वनिर्धारितहरू समावेश गर्नुहोस्" चेक बाकसमा क्लिक गर्नुहोस् ।

source: Value - This interface shows the selected item's current value, minimum allowed value, maximum allowed value, and the minimum increment by which the value may be changed (or zero if this value cannot be determined). The current value can be manually changed via a spin button.
ne: मान - यो इन्टरफेसले चयन गरिएको वस्तुको हालको मान, न्यूनतम अनुमति मान, अधिकतम अनुमति मान, र मान परिवर्तन गर्न सकिने न्यूनतम वृद्धि (वा यदि यो मान निर्धारण गर्न सकिएन भने शून्य) देखाउँदछ । हालको मान स्पिन बटन मार्फत म्यानुअल रूपमा परिवर्तन गर्न सकिन्छ।

# sort
source: 1. What is Accerciser?
ne: १. एक्सर्सिसर के हो?

source: An interactive accessibility explorer
ne: एक अन्तरक्रियात्मक पहुँच अन्वेषक

source: What is <app>Accerciser</app>?
ne: <app>एक्सर्सिसर</app> भनेको के हो?

source: <app>Accerciser</app> is an interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an application is providing correct information to assistive technologies and automated testing frameworks. <app>Accerciser</app> comes with a set of plugins that you can use to create custom views of accessibility information.
ne: <app>एक्सरसिजर</app> एक इंटरैक्टिव पायथन एक्सेसिबिलिटी एक्सप्लोरर है। यसले एटी-एसपीआई लाइब्रेरीको प्रयोग विजेटहरूसँग निरीक्षण, परीक्षण र अन्तरक्रिया गर्न प्रयोग गर्दछ, जसले तपाईंलाई अनुप्रयोगले सहायक टेक्नोलोजीहरू र स्वचालित परीक्षण ढाँचाहरूमा सही जानकारी प्रदान गरिरहेको छ कि छैन भनेर जाँच गर्न अनुमति दिन्छ। <app>एक्सरसिजर</app> प्लगइन्सको सेटको साथ आउँदछ जुन तपाईँले पहुँच जानकारीको अनुकूल दृश्यहरू सिर्जना गर्न प्रयोग गर्न सक्नुहुनेछ।

source: Make sure that accessibility support is enabled in your desktop - otherwise, <app>Accerciser</app> will not work as expected.
ne: तपाईँको डेस्कटपमा पहुँच समर्थन सक्षम पारिएको निश्चित गर्नुहोस् - अन्यथा, <app>एक्सरसिजरले</app> अपेक्षित रूपमा काम गर्दैन।

source: <app>Accerciser</app>
ne: <app>एक्सरसिजर</app>

source: <app>Accerciser</app>'s default interface.
ne: <app>एक्सरसिजरको</app> पूर्वनिर्धारित इन्टरफेस।

source: <app>Accerciser</app>'s intended audience
ne: <app>एक्सरसिजरको</app> इच्छित श्रोताहरू

source: <app>Accerciser</app> fits the needs of many different audiences. User interface developers use it to ensure that their applications are providing all of their features through AT-SPI. Assistive technology developers are able to see what AT-SPI is providing to their applications. Automated UI test developers find <app>Accerciser</app> beneficial since it exposes different events that could be expected from their target application.
ne: <app>एक्सरसिजर</app> धेरै फरक दर्शकहरूको आवश्यकताहरू फिट गर्दछ। प्रयोगकर्ता इन्टरफेस विकासकर्ताहरूले यो सुनिश्चित गर्न प्रयोग गर्छन् कि उनीहरूको अनुप्रयोगहरूले एटी-एसपीआई मार्फत उनीहरूको सबै सुविधाहरू प्रदान गरिरहेका छन्। सहायक टेक्नोलोजी विकासकर्ताहरूले एटी-एसपीआईले उनीहरूको अनुप्रयोगहरूमा के प्रदान गरिरहेको छ भनेर हेर्न सक्षम छन्। स्वचालित यूआई परीक्षण विकासकर्ताहरूले <app>एक्सरसिजरलाई</app> फाइदाजनक भेट्टाउँछन् किनकि यसले विभिन्न घटनाहरू उजागर गर्दछ जुन उनीहरूको लक्षित अनुप्रयोगबाट अपेक्षा गर्न सकिन्छ।

source: <app>Accerciser</app>'s plugin architecture
ne: <app>एक्सरसिजरको</app> प्लगइन आर्किटेक्चर

source: <app>Accerciser</app> has an extensible, plugin-based architecture. Its core code is fairly small and most of its features are part of default plugins:
ne: <app>एक्सरसिजरसँग</app> एक एक्सटेन्सिबल, प्लगइन-आधारित आर्किटेक्चर छ। यसको कोर कोड एकदम सानो छ र यसको अधिकांश सुविधाहरू पूर्वनिर्धारित प्लगइन्सको भाग हो:

source: <link xref="interface_viewer_plugin">Interface Viewer</link> - A plugin that lets you explore the AT-SPI interfaces provided by each accessible widget of a target application.
ne: <link xref="interface_viewer_plugin">इन्टरफेस दर्शक</link> - प्लगइन जसले तपाईंलाई लक्षित अनुप्रयोगको प्रत्येक पहुँच योग्य विजेटद्वारा प्रदान गरिएको एटी-एसपीआई इन्टरफेसहरू अन्वेषण गर्न दिन्छ।

source: <link xref="validator_plugin">AT-SPI Validator</link> - A plugin that applies tests to verify the accessibility of a target application.
ne: <link xref="validator_plugin">एटी-एसपीआई वैधकर्ता</link> - एउटा प्लगइन जसले लक्ष्य अनुप्रयोगको पहुँच प्रमाणित गर्न परीक्षणहरू लागू गर्दछ ।

source: <link xref="event_monitor_plugin">Event Monitor</link> - A plugin that displays AT-SPI events emitted by a target application as they occur.
ne: <link xref="event_monitor_plugin">घटना मोनिटर</link> - एक प्लगइन जसले लक्षित अनुप्रयोगद्वारा उत्सर्जित एटी-एसपीआई घटनाहरू प्रदर्शन गर्दछ।

source: <link xref="quick_select_plugin">Quick Select</link> - A plugin that provides global hotkeys for quickly selecting accessible widgets in <app>Accerciser</app>'s Application Tree View.
ne: <link xref="quick_select_plugin">छिटो चयन गर्नुहोस्</link> - एक प्लगइन जसले <app>एक्सरसिजरको</app> अनुप्रयोग ट्री दृश्यमा पहुँच योग्य विजेटहरू छिटो चयन गर्न विश्वव्यापी हटकीहरू प्रदान गर्दछ।

source: <link xref="api_browser_plugin">API Browser</link> - A plugin that shows the interfaces, methods, and attributes available on each accessible widget of a target application.
ne: <link xref="api_browser_plugin">एपीआई ब्राउजर</link> - एउटा प्लगइन जसले लक्ष्य अनुप्रयोगको प्रत्येक पहुँच योग्य विजेटमा उपलब्ध इन्टरफेसहरू, विधिहरू र विशेषताहरू देखाउँदछ।

source: <link xref="ipython_plugin">IPython Console</link> - A plugin that provides a full, interactive Python shell with access to selected accessible widgets of a target application.
ne: <link xref="ipython_plugin">आईपाइथन कन्सोल</link> - एक प्लगइन जसले लक्ष्य अनुप्रयोगको चयन गरिएको पहुँच योग्य विजेटहरूमा पहुँचको साथ पूर्ण, अन्तरक्रियात्मक पाइथन शेल प्रदान गर्दछ।

source: More about Accessibility
ne: पहुँचको बारेमा थप

source: Accessibility is a core value that should touch all aspects of a Desktop Environment. To help achieve it in GNOME, some libraries were developed, such as ATK and AT-SPI. Though originated in GNOME, these libraries are now also used in other Desktop Environments. To learn more about Accessibility Libraries for GNU/UNIX systems, you can consult:
ne: पहुँच एक कोर मान हो जुन डेस्कटप वातावरणका सबै पक्षहरूलाई छुनु पर्दछ। जिनोममा यसलाई प्राप्त गर्न मद्दत गर्न, केही पुस्तकालयहरू विकास गरिएको थियो, जस्तै एटीके र एटी-एसपीआई। जिनोममा उत्पत्ति भए तापनि यी पुस्तकालयहरू अहिले अन्य डेस्कटप वातावरणमा पनि प्रयोग गरिन्छ। जीएनयू/युनिक्स प्रणालीका लागि पहुँच पुस्तकालयहरूको बारेमा थप जान्न, तपाईं परामर्श गर्न सक्नुहुन्छ:

source: <link href="http://developer.gnome.org/atk/">ATK Accessibility Toolkit</link> - ATK provides the set of accessibility interfaces that are implemented by other toolkits and applications. Using the ATK interfaces, accessibility tools have full access to view and control running applications.
ne: <link href="http://developer.gnome.org/atk/">एटीके एक्सेसिबिलिटी टूलकिट</link> - एटीकेले पहुँच इन्टरफेसहरूको सेट प्रदान गर्दछ जुन अन्य टूलकिट र अनुप्रयोगहरू द्वारा कार्यान्वयन गरिन्छ। एटीके इन्टरफेसहरू प्रयोग गर्दै, पहुँच उपकरणहरूमा चलिरहेको अनुप्रयोगहरू हेर्न र नियन्त्रण गर्न पूर्ण पहुँच छ।

source: <link href="http://developer.gnome.org/at-spi-cspi/stable/">AT-SPI</link> - AT-SPI is the primary service interface by which assistive technologies query and receive notifications from running applications. Additional material is available from the <link href="http://accessibility.kde.org/developer/atk.php#coreclasses">KDE Accessibility Development Community</link>.
ne: <link href="http://developer.gnome.org/at-spi-cspi/stable/">एटी-एसपीआई</link> - एटी-एसपीआई प्राथमिक सेवा इन्टरफेस हो जसद्वारा सहायक टेक्नोलोजीहरू चलिरहेको अनुप्रयोगहरूबाट क्वेरी र सूचनाहरू प्राप्त गर्दछ। <link href="http://accessibility.kde.org/developer/atk.php#coreclasses">केडीई पहुँच विकास समुदाय</link> बाट थप सामग्री उपलब्ध छ.

source: <link href="https://help.gnome.org/users/gnome-help/stable/a11y.html">GNOME Desktop Accessibility Guide</link> - A guide for anyone interested in how the GNOME Desktop supports the needs of users with disabilities.
ne: <link href="https://help.gnome.org/users/gnome-help/stable/a11y.html">जिनोम डेस्कटप पहुँच मार्गदर्शिका</link> - जिनोम डेस्कटपले अपाङ्गता भएका प्रयोगकर्ताहरूको आवश्यकतालाई कसरी समर्थन गर्दछ भन्ने कुरामा चासो राख्ने जो कोहीका लागि एक मार्गदर्शिका।

source: <link href="http://developer.gnome.org/accessibility-devel-guide/stable/">GNOME Accessibility Developer's Guide</link> - A guide for developers who want to ensure their applications are accessible to the widest audience of users.
ne: <link href="http://developer.gnome.org/accessibility-devel-guide/stable/" >जीनोम एक्सेसिबिलिटी डेभलपर गाइड </link> - विकासकर्ताहरूकोलागि एक गाइड जसले उनीहरूको अनुप्रयोगहरू प्रयोगकर्ताहरूको व्यापक दर्शकहरूको लागि पहुँच योग्य छन् भनेर सुनिश्चित गर्न चाहन्छन्।

source: <link href="https://wiki.gnome.org/Accessibility">GNOME Accessibility Project</link> - The GNOME Accessibility Project includes the guides listed above along with many other useful links for users, developers and system administrators.
ne: <link href="https://wiki.gnome.org/Accessibility">जिनोम पहुँच परियोजना</link> - जिनोम पहुँच परियोजनाले प्रयोगकर्ताहरू, विकासकर्ताहरू र प्रणाली प्रशासकहरूका लागि धेरै अन्य उपयोगी लिङ्कहरूको साथ माथि सूचीबद्ध गाइडहरू समावेश गर्दछ।.

# sort
source: 2. IPython Plugin
ne: २. आइपाइथन प्लगइन

source: When all else fails
ne: बाकी सबै विफल भएमा

source: IPython Console Plugin
ne: आइपाइथन कन्सोल प्लगइन

source: The IPython Console Plugin allows real-time interaction with a selected item in the <link xref="desktop_tree_view"> Application Tree View</link>. Since the IPython Console Plugin is an interactive Python shell, you can import any Python modules you want.
ne: आइपाइथन कन्सोल प्लगइनले <link xref="desktop_tree_view">अनुप्रयोग ट्री दृश्य</link>मा मा चयन गरिएको वस्तुसँग वास्तविक-समय अन्तरक्रिया अनुमति दिन्छ। आइपाइथन कन्सोल प्लगइन एक अन्तरक्रियात्मक पाइथन शेल भएकोले, तपाईं आफूले चाहेको कुनै पनि पाइथन मोड्युल आयात गर्न सक्नुहुन्छ।

source: Running the IPython Console Plugin
ne: आइपाइथन कन्सोल प्लगइन चलाउँदै

source: Investigating selected items with the IPython Console Plugin
ne: आइपिथन कन्सोल प्लगइनसँग चयन गरिएका वस्तुहरू खोजी गर्दैछ

# sort
source: 4. Preferences
ne: ४. प्राथमिकताहरू

source: Customizing <app>Accerciser</app>'s preferences
ne: <app>एक्सरसिजरका</app> प्राथमिकताहरू अनुकूलन गर्दै

source: Configuring <app>Accerciser</app>
ne: <app>एक्सरसिजर</app> कन्फिगर गर्दैछ

source: Configuring plugins
ne: प्लगइन कन्फिगर गर्दैछ

source: You may bypass the Preferences dialog by using drag and drop to move a plugin from a location to another.
ne: तपाईँले प्लगइनलाई एक स्थानबाट अर्को स्थानमा सार्न तान्नुहोस् र छोड्नुहोस् प्रयोग गरेर प्राथमिकता संवादलाई बाइपास गर्न सक्नुहुन्छ ।

source: Configuring global hotkeys
ne: विश्वव्यापी हटकीहरू कन्फिगर गर्दैछ

source: Configuring widget's highlighting
ne: विजेटको हाइलाइटिङ कन्फिगर गर्दैछ

source: Some of <app>Accerciser</app>'s elements, such as the global hotkey <keyseq><key>ctrl</key><key>alt</key><key>/</key></keyseq>, highlight a specific widget in a target application. The highlighting duration, border color, and fill color can be customized via the Preferences dialog, under the "Highlighting" tab.
ne: <app>एक्सरसिजरका</app> केही तत्वहरू, जस्तै ग्लोबल हटकी <keyseq><key>सीटीआरएल</key><key>अल्ट</key> <key>/</key></keyseq>, लक्षित अनुप्रयोगमा एक विशिष्ट विजेट हाइलाइट गर्दछ। हाइलाइटिङ अवधि, किनारा रङ, र भर्ने रङ "हाइलाइटिङ" ट्याब अन्तर्गत प्राथमिकता संवाद मार्फत अनुकूलित गर्न सकिन्छ।

# sort
source: 5. Quick Select Plugin
ne: ५. द्रुत चयन प्लगइन

source: Locating the object you need
ne: तपाईँलाई आवश्यक वस्तु फेला पार्दैछ

source: Quick Select Plugin
ne: द्रुत चयन प्लगइन

source: The Quick Select Plugin does not provide a visible interface like the other default <app>Accerciser</app> plugins - instead, it adds facilities for quickly selecting items in the <link xref="desktop_tree_view">Application Tree View</link> via global hotkeys. Originally, these hotkeys were part of <app>Accerciser</app>'s core code, turning into the Quick Select Plugin later.
ne: क्विक सेलेक्ट प्लगइनले अन्य पूर्वनिर्धारित <app>एक्सरसिजर</app> प्लगइन्स जस्तै दृश्यात्मक इन्टरफेस प्रदान गर्दैन - यसको सट्टामा, यसले <लिङ्क एक्सरेफ ="desktop_tree_view" मा वस्तुहरू छिटो चयन गर्नका लागि सुविधाहरू थप्दछ ></link>विश्वव्यापी हटकीहरू मार्फत अनुप्रयोग ट्री दृश्य। मूलतः, यी हटकीहरू <app>एक्सर्साइजरको</app> कोर कोडको भाग थिए, पछि क्विक सेलेक्ट प्लगइनमा परिणत भए।

source: The Quick Select Plugin provides two global hotkeys. Pressing <keyseq><key>ctrl</key><key>alt</key><key>a</key></keyseq> selects the last focused accessible widget in the Application Tree View. Pressing <keyseq><key>ctrl</key><key>alt</key><key>/</key></keyseq> selects the accessible widget under the pointer in the Application Tree View and highlights it in the target application.
ne: क्विक सेलेक्ट प्लगइनले दुई ग्लोबल हटकीहरू प्रदान गर्दछ। <keyseq><key>Ctrl</key><key>alt</key><key>a</key></keyseq> थिच्दा अनुप्रयोग ट्री दृश्यमा अन्तिम फोकस गरिएको पहुँच योग्य विजेट चयन गर्दछ । <keyseq><key>Ctrl</key><key>अल्ट</key><key></key></keyseq> थिच्दा/ अनुप्रयोग ट्री दृश्यमा सूचक अन्तर्गत पहुँच योग्य विजेट चयन गर्दछ र यसलाई लक्षित अनुप्रयोगमा हाइलाइट गर्दछ ।

# sort
source: 3. Validator Default Plugin
ne: ३. वैधकर्ता पूर्वनिर्धारित प्लगइन

source: Testing an application for accessibility
ne: पहुँचका लागि अनुप्रयोग परीक्षण गर्दै

source: AT-SPI Validator Plugin
ne: एटी-एसपीआई वैधकर्ता प्लगइन

source: Running the AT-SPI Validator Plugin
ne: एटी-एसपीआई वैधकर्ता प्लगइन चलिरहेको छ

source: If you want to save the generated report in your system, just click the <cmd>Save</cmd> button. To clear the validation screen, press the <cmd>Clear</cmd> button.
ne: यदि तपाईं आफ्नो प्रणालीमा उत्पन्न रिपोर्ट बचत गर्न चाहनुहुन्छ भने, बस <cmd>बचत</cmd> बटन क्लिक गर्नुहोस्। प्रमाणीकरण स्क्रिन खाली गर्न, <cmd>खाली बटन </cmd> थिच्नुहोस्।

source: To get more information about an error in the generated report, make sure the corresponding item is selected and press the <cmd>Help</cmd> button. It will open a Help Page in your default browser.
ne: जेनेरेट गरिएको प्रतिवेदनमा त्रुटिको बारेमा थप जानकारी प्राप्त गर्न, सम्बन्धित वस्तु चयन गरिएको सुनिश्चित गर्नुहोस् र <cmd>मद्दत </cmd>बटन थिच्नुहोस् । यसले तपाईँको पूर्वनिर्धारित ब्राउजरमा सहायता पृष्ठ खोल्नेछ ।
