Repository: GNOME/accerciser
Catalog: po/*.po
Languages: az, en@shaw, ne

source: Give your application an accessibility workout
az: Tətbiqinizə əlçatanlıq testi keçirin
en@shaw: ğ‘œğ‘¦ğ‘ ğ‘¿ğ‘¼ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘©ğ‘¯ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘¦ğ‘¤ğ‘¦ğ‘‘ğ‘° ğ‘¢ğ‘»ğ‘’ğ‘¶ğ‘‘

source: accessibility;development;test;
az: əlçatanlıq;inkişaf;test;

source: A list of plugins that are disabled by default
az: Susmaya görə deaktiv edilən plaginlərin siyahısı
en@shaw: ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘ ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ğ‘Ÿ ğ‘ğ‘¨ğ‘‘ ğ‘¸ ğ‘›ğ‘¦ğ‘•ğ‘±ğ‘šğ‘©ğ‘¤ğ‘› ğ‘šğ‘² ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘

source: A list of plugins that are disabled by default.
az: Susmaya görə deaktiv edilən plaginlərin siyahısı.

source: Highlight duration
az: Vurğulama müddəti
en@shaw: ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘›ğ‘«ğ‘®ğ‘±ğ‘–ğ‘©ğ‘¯

source: The duration of the highlight box when selecting accessible nodes.
az: Əlçatan düyünləri seçərkən vurğulama qutusunun müddəti.

source: Highlight fill color
az: Vurğulama doldurma rəngi
en@shaw: ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘“ğ‘¦ğ‘¤ ğ‘’ğ‘³ğ‘¤ğ‘¼

source: The color and opacity of the highlight fill.
az: Vurğulama doldurmasının rəngi və şəffaflığı.
en@shaw: ğ‘ ğ‘’ğ‘³ğ‘¤ğ‘¼ ğ‘¯ ğ‘´ğ‘ğ‘¨ğ‘•ğ‘©ğ‘‘ğ‘° ğ‘ ğ‘ ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘“ğ‘¦ğ‘¤.

source: Highlight border color
az: Vurğulama sərhəd rəngi
en@shaw: ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘šğ‘¹ğ‘›ğ‘¼ ğ‘’ğ‘³ğ‘¤ğ‘¼

source: The color and opacity of the highlight border.
az: Vurğulama sərhədinin rəngi və şəffaflığı.
en@shaw: ğ‘ ğ‘’ğ‘³ğ‘¤ğ‘¼ ğ‘¯ ğ‘´ğ‘ğ‘¨ğ‘•ğ‘©ğ‘‘ğ‘° ğ‘ ğ‘ ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘šğ‘¹ğ‘›ğ‘¼.

source: Horizontal split
az: Üfüqi bölünmə

source: Position of the horizontal split of the main window.
az: Əsas pəncərənin üfüqi bölünmə mövqeyi.

source: Vertical split
az: Şaquli bölünmə

source: Position of the vertical split of the main window.
az: Əsas pəncərənin şaquli bölünmə mövqeyi.

source: Default window height
az: Susmaya görə pəncərə hündürlüyü

source: The window height value.
az: Pəncərə hündürlüyü dəyəri.

source: Default window width
az: Susmaya görə pəncərə eni

source: The window width value.
az: Pəncərə eni dəyəri.

source: The layout for the bottom panel
az: Aşağı panel üçün tərtibat

source: The layout for the bottom panel pluginview.
az: Aşağı panel plagin görünüşü üçün tərtibat.

source: The layout for the top panel
az: Üst panel üçün tərtibat

source: The layout for the top panel pluginview.
az: Üst panel plagin görünüşü üçün tərtibat.

source: Single layout view
az: Tək tərtibat görünüşü

source: View plugins in a single layout.
az: Plaginləri tək tərtibatda göstər.

source: Available new pluginviews
az: Mövcud yeni plagin görünüşləri

source: This list contains all the new available pluginviews
az: Bu siyahı bütün mövcud yeni plagin görünüşlərini ehtiva edir

source: The pluginview layout
az: Plagin görünüşü tərtibatı

source: The default plugin layout for the top panel.
az: Üst panel üçün susmaya görə plagin tərtibatı.

source: Window height
az: Pəncərə hündürlüyü

source: Window height value.
az: Pəncərə hündürlüyü dəyəri.

source: Window width
az: Pəncərə eni

source: Window width value.
az: Pəncərə eni dəyəri.

source: Hotkey combination
az: Qısayol kombinasiyası

source: Hotkey combination for related action.
az: Əlaqəli hərəkət üçün qısayol kombinasiyası.

source: The GNOME Project
az: GNOME Layihəsi

source: Accessibility explorer for the GNOME desktop
az: GNOME iş masası üçün əlçatanlıq tədqiqatçısı

source: Accerciser is an interactive Python accessibility explorer for the GNOME desktop. It uses AT-SPI to inspect and control widgets, allowing you to check if an application is providing correct information to assistive technologies and automated test frameworks.
az: Accerciser GNOME iş masası üçün interaktiv Python əlçatanlıq tədqiqatçısıdır. O, AT-SPI istifadə edərək vidjetləri yoxlamaq və idarə etmək imkanı verir, beləliklə tətbiqin köməkçi texnologiyalara və avtomatlaşdırılmış test çərçivələrinə düzgün məlumat təqdim edib-etmədiyini yoxlaya bilərsiniz.

source: Accerciser has a simple plugin framework which you can use to create custom views of accessibility information.
az: Accerciser əlçatanlıq məlumatlarının xüsusi görünüşlərini yaratmaq üçün istifadə edə biləcəyiniz sadə plagin çərçivəsinə malikdir.

source: API Browser
az: API Səyyahı

source: Browse the various methods of the current accessible
az: Cari əlçatanın müxtəlif metodlarını araşdırın
en@shaw: ğ‘šğ‘®ğ‘¬ğ‘Ÿ ğ‘ ğ‘ğ‘ºğ‘¦ğ‘©ğ‘• ğ‘¥ğ‘§ğ‘”ğ‘©ğ‘›ğ‘Ÿ ğ‘ ğ‘ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤

source: Hide private attributes
az: Şəxsi atributları gizlət
en@shaw: ğ‘£ğ‘²ğ‘› ğ‘ğ‘®ğ‘²ğ‘ğ‘©ğ‘‘ ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ğ‘•

source: Method
az: Metod
en@shaw: ğ‘¥ğ‘§ğ‘”ğ‘©ğ‘›

source: Property
az: Xüsusiyyət
en@shaw: ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦

source: Value
az: Dəyər
en@shaw: ğ‘ğ‘¨ğ‘¤ğ‘¿

source: IPython Console
az: IPython Konsolu

source: Interactive console for manipulating currently selected accessible
az: Cari seçilmiş əlçatanı idarə etmək üçün interaktiv konsol
en@shaw: ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘•ğ‘´ğ‘¤ ğ‘“ğ‘¹ ğ‘¥ğ‘©ğ‘¯ğ‘¦ğ‘ğ‘˜ğ‘©ğ‘¤ğ‘±ğ‘‘ğ‘¦ğ‘™ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ğ‘¤ğ‘¦ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤

source: Event monitor
az: Hadisə monitoru

source: _Monitor Events
az: _Hadisələri izlə
en@shaw: _ğ‘¥ğ‘ªğ‘¯ğ‘¦ğ‘‘ğ‘¼ ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ğ‘•

source: _Clear
az: _Təmizlə

source: _Save
az: _Saxla

source: Select _All
az: _Hamısını seç

source: C_lear Selection
az: Seçimi _təmizlə

source: Everything
az: Hər şey
en@shaw: ğ‘§ğ‘ğ‘®ğ‘¦ğ‘”ğ‘¦ğ‘™

source: Selected application
az: Seçilmiş tətbiq
en@shaw: ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯

source: Selected accessible
az: Seçilmiş əlçatan
en@shaw: ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤

source: Source
az: Mənbə
en@shaw: ğ‘•ğ‘¹ğ‘•

source: Name
az: Ad
en@shaw: ğ‘¯ğ‘±ğ‘¥

source: Full Name
az: Tam Ad

source: Event Monitor
az: Hadisə Monitoru
en@shaw: ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ ğ‘¥ğ‘ªğ‘¯ğ‘¦ğ‘‘ğ‘¼

source: Shows events as they occur from selected types and sources
az: Seçilmiş növlərdən və mənbələrdən baş verən hadisələri göstərir
en@shaw: ğ‘–ğ‘´ğ‘Ÿ ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ğ‘• ğ‘¨ğ‘Ÿ ğ‘ğ‘± ğ‘ªğ‘’ğ‘» ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘‘ğ‘²ğ‘ğ‘• ğ‘¯ ğ‘•ğ‘¹ğ‘•ğ‘©ğ‘Ÿ

source: Highlight last event entry
az: Son hadisə girişini vurğula
en@shaw: ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘¤ğ‘­ğ‘•ğ‘‘ ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦

source: Start/stop event recording
az: Hadisə qeydini başla/dayandır
en@shaw: ğ‘•ğ‘‘ğ‘¸ğ‘‘/ğ‘•ğ‘‘ğ‘ªğ‘ ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ ğ‘®ğ‘¦ğ‘’ğ‘¹ğ‘›ğ‘¦ğ‘™

source: Clear event log
az: Hadisə qeydini təmizlə
en@shaw: ğ‘’ğ‘¤ğ‘½ ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ ğ‘¤ğ‘ªğ‘œ

source: Save monitor output
az: Monitor çıxışını saxla

source: _OK
az: _Tamam

source: _Cancel
az: _Ləğv et

source: Child count
az: Alt element sayı

source: (no description)
az: (təsvir yoxdur)

source: Description
az: Təsvir
en@shaw: ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: Help text
az: Yardım mətni

source: (no ID)
az: (ID yoxdur)

source: Locale
az: Lokal
en@shaw: ğ‘¤ğ‘´ğ‘’ğ‘¨ğ‘¤

source: Process ID
az: Proses ID-si

source: States
az: Vəziyyətlər

source: Attributes
az: Atributlar

source: Show
az: Göstər
en@shaw: ğ‘–ğ‘´

source: Relations
az: Əlaqələr

source: _Accessible
az: _Əlçatan
en@shaw: _ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤

source: Key binding
az: Açar bağlama

source: Perform action
az: Hərəkəti icra et
en@shaw: ğ‘ğ‘¼ğ‘“ğ‘¹ğ‘¥ ğ‘¨ğ‘’ğ‘–ğ‘©ğ‘¯

source: Acti_on
az: _Hərəkət

source: Toolkit
az: Alətlər dəsti

source: Version
az: Versiya
en@shaw: ğ‘ğ‘»ğ‘ ğ‘©ğ‘¯

source: AT-SPI IPC Version
az: AT-SPI IPC Versiyası

source: Ap_plication
az: _Tətbiq

source: Col_lection
az: _Kolleksiya

source: Absolute position
az: Mütləq mövqe
en@shaw: ğ‘¨ğ‘šğ‘•ğ‘´ğ‘¤ğ‘µğ‘‘ ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯

source: Window relative position
az: Pəncərəyə nisbətən mövqe

source: Parent relative position
az: Üst elementə nisbətən mövqe

source: Size
az: Ölçü
en@shaw: ğ‘•ğ‘²ğ‘Ÿ

source: Layer
az: Qat
en@shaw: ğ‘¤ğ‘±ğ‘¼

source: WIDGET
az: VİDCET
en@shaw: ğ‘¢ğ‘¦ğ‘¡ğ‘©ğ‘‘

source: MDI-Z-order
az: MDI-Z-sırası

source: Alpha
az: Alfa
en@shaw: ğ‘¨ğ‘¤ğ‘“ğ‘©

source: Co_mponent
az: _Komponent

source: Des_ktop
az: _İş masası

source: Locale:
az: Lokal:
en@shaw: ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤:

source: _Document
az: _Sənəd
en@shaw: _ğ‘›ğ‘ªğ‘’ğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘

source: Anchor count
az: Lövbər sayı

source: Start index
az: Başlanğıc indeksi

source: End index
az: Son indeks

source: Valid
az: Keçərli

source: Hyperlink
az: Hiperlink
en@shaw: ğ‘£ğ‘²ğ‘ğ‘»ğ‘¤ğ‘¦ğ‘™ğ‘’

source: H_ypertext
az: _Hipermətn

source: Position
az: Mövqe
en@shaw: ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯

source: _Image
az: _Şəkil
en@shaw: _ğ‘¦ğ‘¥ğ‘¦ğ‘¡

source: Lo_gin Helper
az: _Giriş köməkçisi

source: Select All
az: Hamısını seç
en@shaw: ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ ğ‘·ğ‘¤

source: _Selection
az: _Seçim
en@shaw: _ğ‘•ğ‘¦ğ‘¤ğ‘§ğ‘’ğ‘–ğ‘©ğ‘¯

source: Content type
az: Məzmun növü

source: St_reamable Content
az: _Axın edilə bilən məzmun

source: Caption:
az: Başlıq:

source: Summary:
az: Xülasə:

source: Rows
az: Sətirlər
en@shaw: ğ‘®ğ‘´ğ‘Ÿ

source: Columns
az: Sütunlar
en@shaw: ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ğ‘Ÿ

source: Selected rows
az: Seçilmiş sətirlər
en@shaw: ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘®ğ‘´ğ‘Ÿ

source: Selected columns
az: Seçilmiş sütunlar
en@shaw: ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ğ‘Ÿ

source: Table Information
az: Cədvəl məlumatları

source: name (x,y)
az: ad (x,y)
en@shaw: ğ‘¯ğ‘±ğ‘¥ (x,y)

source: Header:
az: Başlıq:
en@shaw: ğ‘£ğ‘§ğ‘›ğ‘¼:

source: <no description>
az: <təsvir yoxdur>
en@shaw: <ğ‘¯ğ‘´ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯>

source: Extents:
az: Ölçülər:

source: Row
az: Sətir
en@shaw: ğ‘®ğ‘´

source: Column
az: Sütun
en@shaw: ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥

source: Selected Cell
az: Seçilmiş hüceyrə

source: _Table
az: _Cədvəl
en@shaw: _ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤

source: Row span
az: Sətir aralığı

source: Column span
az: Sütun aralığı

source: Row headers
az: Sətir başlıqları

source: Column headers
az: Sütun başlıqları

source: Table
az: Cədvəl

source: _TableCell
az: _Cədvəl Hüceyrəsi

source: Text
az: Mətn

source: Caret Offset
az: Kursor Ofseti

source: Offset
az: Ofset
en@shaw: ğ‘ªğ‘“ğ‘•ğ‘§ğ‘‘

source: Include defaults
az: Susmaya görə daxil et
en@shaw: ğ‘¦ğ‘¯ğ‘’ğ‘¤ğ‘µğ‘› ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ğ‘•

source: Start: 0
az: Başlanğıc: 0

source: End: 0
az: Son: 0

source: Te_xt
az: _Mətn

source: Current value
az: Cari dəyər
en@shaw: ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Minimum value
az: Minimum dəyər
en@shaw: ğ‘¥ğ‘¦ğ‘¯ğ‘©ğ‘¥ğ‘©ğ‘¥ ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Maximum value
az: Maksimum dəyər
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘¦ğ‘¥ğ‘©ğ‘¥ ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Minimum increment
az: Minimum artım
en@shaw: ğ‘¥ğ‘¦ğ‘¯ğ‘©ğ‘¥ğ‘©ğ‘¥ ğ‘¦ğ‘¯ğ‘’ğ‘®ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘

source: Val_ue
az: _Dəyər

source: unknown
az: naməlum

source: Interface Viewer
az: İnterfeys Göstəricisi
en@shaw: ğ‘¦ğ‘¯ğ‘‘ğ‘¼ğ‘“ğ‘±ğ‘• ğ‘ğ‘¿ğ‘¼

source: Allows viewing of various interface properties
az: Müxtəlif interfeys xüsusiyyətlərinin göstərilməsinə imkan verir
en@shaw: ğ‘©ğ‘¤ğ‘¬ğ‘Ÿ ğ‘ğ‘¿ğ‘¦ğ‘™ ğ‘ ğ‘ğ‘ºğ‘¦ğ‘©ğ‘• ğ‘¦ğ‘¯ğ‘‘ğ‘¼ğ‘“ğ‘±ğ‘• ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ

source: (not implemented)
az: (həyata keçirilməyib)
en@shaw: (ğ‘¯ğ‘ªğ‘‘ ğ‘¦ğ‘¥ğ‘ğ‘¤ğ‘©ğ‘¥ğ‘§ğ‘¯ğ‘‘ğ‘©ğ‘›)

source: (no help text)
az: (yardım mətni yoxdur)

source: Start
az: Başlanğıc
en@shaw: ğ‘•ğ‘‘ğ‘¸ğ‘‘

source: End
az: Son
en@shaw: ğ‘§ğ‘¯ğ‘›

source: Too many selectable children
az: Çox sayda seçilə bilən alt element
en@shaw: ğ‘‘ğ‘µ ğ‘¥ğ‘§ğ‘¯ğ‘¦ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘—ğ‘¦ğ‘¤ğ‘›ğ‘®ğ‘©ğ‘¯

source: (Editable)
az: (Düzəldilə bilər)

source: Start: %d
az: Başlanğıc: %d

source: End: %d
az: Son: %d

source: Quick Select
az: Sürətli Seçim
en@shaw: ğ‘’ğ‘¢ğ‘¦ğ‘’ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘

source: Plugin with various methods of selecting accessibles quickly.
az: Əlçatanları sürətlə seçmək üçün müxtəlif metodlara malik plagin.

source: Inspect last focused accessible
az: Son fokuslanmış əlçatanı yoxla
en@shaw: ğ‘¦ğ‘¯ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ ğ‘¤ğ‘­ğ‘•ğ‘‘ ğ‘“ğ‘´ğ‘’ğ‘©ğ‘•ğ‘‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤

source: Inspect accessible under mouse
az: Siçan altında olan əlçatanı yoxla
en@shaw: ğ‘¦ğ‘¯ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘³ğ‘¯ğ‘›ğ‘¼ ğ‘¥ğ‘¬ğ‘•

source: Sche_ma:
az: Sxe_m:

source: V_alidate
az: _Doğrula

source: _Help
az: _Yardım
en@shaw: _ğ‘£ğ‘§ğ‘¤ğ‘

source: Idle
az: Boş
en@shaw: ğ‘²ğ‘›ğ‘©ğ‘¤

source: No description
az: Təsvir yoxdur
en@shaw: ğ‘¯ğ‘´ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: AT-SPI Validator
az: AT-SPI Doğrulayıcı

source: Validates application accessibility
az: Tətbiqin əlçatanlığını doğrulayır
en@shaw: ğ‘ğ‘¨ğ‘¤ğ‘©ğ‘›ğ‘±ğ‘‘ğ‘• ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘¦ğ‘¤ğ‘¦ğ‘‘ğ‘°

source: Level
az: Səviyyə
en@shaw: ğ‘¤ğ‘§ğ‘ğ‘©ğ‘¤

source: Role
az: Rol
en@shaw: ğ‘®ğ‘´ğ‘¤

source: Save validator output
az: Doğrulayıcı çıxışını saxla

source: Saving
az: Saxlanılır
en@shaw: ğ‘•ğ‘±ğ‘ğ‘¦ğ‘™

source: Validating
az: Doğrulanır
en@shaw: ğ‘ğ‘¨ğ‘¤ğ‘©ğ‘›ğ‘±ğ‘‘ğ‘¦ğ‘™

source: EXCEPT
az: İSTİSNA
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘§ğ‘ğ‘‘

source: ERROR
az: XƏTA
en@shaw: ğ‘»ğ‘¼

source: WARN
az: XƏBƏRDARLIQ
en@shaw: ğ‘¢ğ‘¹ğ‘¯

source: INFO
az: MƏLUMAT
en@shaw: ğ‘¦ğ‘¯ğ‘“ğ‘´

source: DEBUG
az: SƏHVSİZLƏŞDİRMƏ
en@shaw: ğ‘›ğ‘°ğ‘šğ‘³ğ‘œ

source: Basic
az: Əsas
en@shaw: ğ‘šğ‘±ğ‘•ğ‘¦ğ‘’

source: Tests fundamental GUI application accessibility
az: Əsas GUI tətbiq əlçatanlığını yoxlayır
en@shaw: ğ‘‘ğ‘§ğ‘•ğ‘‘ğ‘• ğ‘“ğ‘³ğ‘¯ğ‘›ğ‘©ğ‘¥ğ‘§ğ‘¯ğ‘‘ğ‘©ğ‘¤ GUI ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘¦ğ‘¤ğ‘¦ğ‘‘ğ‘°

source: actionable %s is not focusable or selectable
az: hərəkətə gətirilə bilən %s fokuslana və ya seçilə bilmir

source: interactive %s is not actionable
az: interaktiv %s hərəkətə gətirilə bilmir
en@shaw: ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ %s ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘¨ğ‘’ğ‘–ğ‘©ğ‘¯ğ‘©ğ‘šğ‘©ğ‘¤

source: more than one focused widget
az: birdən çox fokuslanmış vidjet
en@shaw: ğ‘¥ğ‘¹ ğ‘ğ‘¨ğ‘¯ ğ‘¢ğ‘³ğ‘¯ ğ‘“ğ‘´ğ‘’ğ‘©ğ‘•ğ‘‘ ğ‘¢ğ‘¦ğ‘¡ğ‘©ğ‘‘

source: %s has no text interface
az: %s mətn interfeysinə malik deyil
en@shaw: %s ğ‘£ğ‘¨ğ‘Ÿ ğ‘¯ğ‘´ ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘ ğ‘¦ğ‘¯ğ‘‘ğ‘¼ğ‘“ğ‘±ğ‘•

source: %s index in parent does not match child index
az: %s-in üst elementdəki indeksi alt element indeksinə uyğun gəlmir
en@shaw: %s ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘• ğ‘¦ğ‘¯ ğ‘ğ‘ºğ‘©ğ‘¯ğ‘‘ ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘¥ğ‘¨ğ‘— ğ‘—ğ‘²ğ‘¤ğ‘› ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘•

source: Missing reciprocal for %s relation
az: %s əlaqəsi üçün qarşılıqlı əlaqə yoxdur
en@shaw: ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ ğ‘®ğ‘©ğ‘•ğ‘¦ğ‘ğ‘®ğ‘©ğ‘’ğ‘©ğ‘¤ ğ‘“ğ‘¹ %s ğ‘®ğ‘¦ğ‘¤ğ‘±ğ‘–ğ‘©ğ‘¯

source: %s missing name or label
az: %s-də ad və ya etiket yoxdur
en@shaw: %s ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ ğ‘¯ğ‘±ğ‘¥ ğ‘¹ ğ‘¤ğ‘±ğ‘šğ‘©ğ‘¤

source: focusable %s has a table interface, but not a selection interface
az: fokuslana bilən %s cədvəl interfeysinə malikdir, lakin seçim interfeysi yoxdur

source: %s has %s state without %s state
az: %s %s vəziyyətinə malikdir, lakin %s vəziyyəti yoxdur
en@shaw: %s ğ‘£ğ‘¨ğ‘Ÿ %s ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘¢ğ‘¦ğ‘ğ‘¬ğ‘‘ %s ğ‘•ğ‘‘ğ‘±ğ‘‘

source: %s does not belong to a set
az: %s heç bir dəstə aid deyil
en@shaw: %s ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘¦ğ‘¤ğ‘ªğ‘™ ğ‘‘ ğ‘© ğ‘•ğ‘§ğ‘‘

source: %(rolename)s index %(num)d does not match row and column
az: %(rolename)s indeksi %(num)d sətir və sütuna uyğun gəlmir

source: %(rolename)s parent index %(num1)d does not match row and column index %(num2)d
az: %(rolename)s üst element indeksi %(num1)d sətir və sütun indeksi %(num2)d ilə uyğun gəlmir

source: %s has no name or description
az: %s-in adı və ya təsviri yoxdur
en@shaw: %s ğ‘£ğ‘¨ğ‘Ÿ ğ‘¯ğ‘´ ğ‘¯ğ‘±ğ‘¥ ğ‘¹ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: _Quit
az: _Çıx

source: _Preferences…
az: _Tənzimləmələr…

source: _Contents
az: _Məzmun
en@shaw: _ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘©ğ‘¯ğ‘‘ğ‘•

source: _About
az: _Haqqında

source: <dead>
az: <ölü>
en@shaw: <ğ‘›ğ‘§ğ‘›>

source: Children
az: Alt elementlər
en@shaw: ğ‘—ğ‘¦ğ‘¤ğ‘›ğ‘®ğ‘©ğ‘¯

source: _Show Applications without children
az: Alt elementləri olmayan _tətbiqləri göstər

source: _Refresh Registry
az: _Reyestri yenilə
en@shaw: _ğ‘®ğ‘°ğ‘“ğ‘®ğ‘§ğ‘– ğ‘®ğ‘§ğ‘¡ğ‘¦ğ‘•ğ‘‘ğ‘®ğ‘°

source: Refresh _Node
az: _Düyünü yenilə
en@shaw: ğ‘®ğ‘°ğ‘“ğ‘®ğ‘§ğ‘– _ğ‘¯ğ‘´ğ‘›

source: Component
az: Komponent
en@shaw: ğ‘’ğ‘©ğ‘¥ğ‘ğ‘´ğ‘¯ğ‘©ğ‘¯ğ‘‘

source: Task
az: Tapşırıq
en@shaw: ğ‘‘ğ‘­ğ‘•ğ‘’

source: Key
az: Açar
en@shaw: ğ‘’ğ‘°

source: Accerciser Accessibility Explorer
az: Accerciser Əlçatanlıq Tədqiqatçısı

source: Top panel
az: Üst panel
en@shaw: ğ‘‘ğ‘ªğ‘ ğ‘ğ‘¨ğ‘¯ğ‘©ğ‘¤

source: Bottom panel
az: Aşağı panel
en@shaw: ğ‘šğ‘ªğ‘‘ğ‘«ğ‘¥ ğ‘ğ‘¨ğ‘¯ğ‘©ğ‘¤

source: _File
az: _Fayl
en@shaw: _ğ‘“ğ‘²ğ‘¤

source: _Edit
az: _Düzəlt
en@shaw: _ğ‘§ğ‘›ğ‘¦ğ‘‘

source: _Bookmarks
az: _Nişanlar

source: _View
az: _Görünüş

source: accerciser Preferences
az: Accerciser Tənzimləmələri

source: _Close
az: _Bağla

source: Plugins
az: Plaginlər
en@shaw: ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ğ‘Ÿ

source: Global Hotkeys
az: Qlobal Qısayollar

source: Highlighting
az: Vurğulama
en@shaw: ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ğ‘¦ğ‘™

source: Highlight duration:
az: Vurğulama müddəti:
en@shaw: ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘›ğ‘«ğ‘®ğ‘±ğ‘–ğ‘©ğ‘¯:

source: Border color:
az: Sərhəd rəngi:
en@shaw: ğ‘šğ‘¹ğ‘›ğ‘¼ ğ‘’ğ‘³ğ‘¤ğ‘¼:

source: The border color of the highlight box
az: Vurğulama qutusunun sərhəd rəngi
en@shaw: ğ‘ ğ‘šğ‘¹ğ‘›ğ‘¼ ğ‘’ğ‘³ğ‘¤ğ‘¼ ğ‘ ğ‘ ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘šğ‘ªğ‘’ğ‘•

source: Fill color:
az: Doldurma rəngi:
en@shaw: ğ‘“ğ‘¦ğ‘¤ ğ‘’ğ‘³ğ‘¤ğ‘¼:

source: The fill color of the highlight box
az: Vurğulama qutusunun doldurma rəngi
en@shaw: ğ‘ ğ‘“ğ‘¦ğ‘¤ ğ‘’ğ‘³ğ‘¤ğ‘¼ ğ‘ ğ‘ ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘šğ‘ªğ‘’ğ‘•

source: translator-credits
az: Tərcümə: Ramal Rəhimov <jhonaluman@gmail.com>
en@shaw: ğ‘‘ğ‘®ğ‘©ğ‘¯ğ‘•ğ‘¤ğ‘±ğ‘‘ğ‘¼-ğ‘’ğ‘®ğ‘§ğ‘›ğ‘¦ğ‘‘ğ‘•

source: An interactive Python accessibility explorer
az: İnteraktiv Python əlçatanlıq tədqiqatçısı
en@shaw: ğ‘©ğ‘¯ ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ ğ‘ğ‘²ğ‘”ğ‘­ğ‘¯ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘¦ğ‘¤ğ‘¦ğ‘‘ğ‘° ğ‘¦ğ‘’ğ‘•ğ‘ğ‘¤ğ‘¹ğ‘¼

source: accerciser Copyright © 2006, 2007 IBM Corporation (BSD)
az: Accerciser Müəllif Hüququ © 2006, 2007 IBM Corporation (BSD)

source: The New BSD License. See the COPYING and NOTICE files for details.
az: Yeni BSD Lisenziyası. Ətraflı məlumat üçün COPYING və NOTICE fayllarına baxın.

source: Web site
az: Veb sayt
en@shaw: ğ‘¢ğ‘§ğ‘š ğ‘•ğ‘²ğ‘‘

source: _Add Bookmark…
az: _Nişan əlavə et…

source: _Edit Bookmarks…
az: _Nişanları düzəlt…

source: Edit Bookmarks…
az: Nişanları düzəlt…

source: _Add
az: _Əlavə et

source: _Remove
az: _Sil

source: _Jump to
az: _Keç

source: Title
az: Başlıq
en@shaw: ğ‘‘ğ‘²ğ‘‘ğ‘©ğ‘¤

source: Application
az: Tətbiq
en@shaw: ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯

source: Path
az: Yol
en@shaw: ğ‘ğ‘­ğ‘”

source: Add Bookmark…
az: Nişan əlavə et…

source: Title:
az: Başlıq:
en@shaw: ğ‘‘ğ‘²ğ‘‘ğ‘©ğ‘¤:

source: Application:
az: Tətbiq:
en@shaw: ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯:

source: Path:
az: Yol:
en@shaw: ğ‘ğ‘­ğ‘”:

source: Plugin Errors
az: Plagin xətaları
en@shaw: ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ ğ‘»ğ‘¼ğ‘Ÿ

source: _Refresh
az: _Yenilə

# viewport
source: View
az: Görünüş
en@shaw: ğ‘ğ‘¿

source: No view
az: Görünüş yoxdur
en@shaw: ğ‘¯ğ‘´ ğ‘ğ‘¿

source: _Single plugins view
az: _Tək plagin görünüşü
en@shaw: _ğ‘•ğ‘¦ğ‘™ğ‘œğ‘©ğ‘¤ ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ğ‘Ÿ ğ‘ğ‘¿

source: Plugin View
az: Plagin Görünüşü
en@shaw: ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ ğ‘ğ‘¿

source: Plugin View (%d)
az: Plagin Görünüşü (%d)
en@shaw: ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ ğ‘ğ‘¿ (%d)

source: _New view…
az: _Yeni görünüş…

source: New View…
az: Yeni Görünüş…

source: The default plugin layout for the bottom panel
en@shaw: ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ ğ‘¤ğ‘±ğ‘¬ğ‘‘ ğ‘“ğ‘¹ ğ‘ ğ‘šğ‘ªğ‘‘ğ‘«ğ‘¥ ğ‘ğ‘¨ğ‘¯ğ‘©ğ‘¤

source: The default plugin layout for the top panel
en@shaw: ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘¤ğ‘³ğ‘œğ‘¦ğ‘¯ ğ‘¤ğ‘±ğ‘¬ğ‘‘ ğ‘“ğ‘¹ ğ‘ ğ‘‘ğ‘ªğ‘ ğ‘ğ‘¨ğ‘¯ğ‘©ğ‘¤

source: The duration of the highlight box when selecting accessible nodes
en@shaw: ğ‘ ğ‘›ğ‘«ğ‘®ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘ ğ‘£ğ‘²ğ‘¤ğ‘²ğ‘‘ ğ‘šğ‘ªğ‘’ğ‘• ğ‘¢ğ‘§ğ‘¯ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘¯ğ‘´ğ‘›ğ‘Ÿ

source: <b>Event monitor</b>
en@shaw: <b>ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ ğ‘¥ğ‘ªğ‘¯ğ‘¦ğ‘‘ğ‘¼</b>

source: <b>Attributes</b>
en@shaw: <b>ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ğ‘•</b>

source: <b>Child count</b>
en@shaw: <b>ğ‘—ğ‘²ğ‘¤ğ‘› ğ‘’ğ‘¬ğ‘¯ğ‘‘</b>

source: <b>Description</b>
en@shaw: <b>ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯</b>

source: <b>Relations</b>
en@shaw: <b>ğ‘®ğ‘¦ğ‘¤ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ</b>

source: <b>Selected Cell</b>
en@shaw: <b>ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘•ğ‘§ğ‘¤</b>

source: <b>States</b>
en@shaw: <b>ğ‘•ğ‘‘ğ‘±ğ‘‘ğ‘•</b>

source: <b>Table Information</b>
en@shaw: <b>ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘¦ğ‘¯ğ‘“ğ‘¼ğ‘¥ğ‘±ğ‘–ğ‘©ğ‘¯</b>

source: <b>Text</b>
en@shaw: <b>ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘</b>

source: <b>unknown</b>
en@shaw: <b>ğ‘³ğ‘¯ğ‘´ğ‘¯</b>

source: <i>(no description)</i>
en@shaw: <i>(ğ‘¯ğ‘´ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯)</i>

source: <i>Caption:</i>
en@shaw: <i>ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯:</i>

source: <i>End: 0</i>
en@shaw: <i>ğ‘§ğ‘¯ğ‘›: 0</i>

source: <i>Start: 0</i>
en@shaw: <i>ğ‘•ğ‘‘ğ‘¸ğ‘‘: 0</i>

source: <i>Summary:</i>
en@shaw: <i>ğ‘•ğ‘³ğ‘¥ğ‘¼ğ‘¦:</i>

source: Relative position
en@shaw: ğ‘®ğ‘§ğ‘¤ğ‘©ğ‘‘ğ‘¦ğ‘ ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯

source: <i>(Editable)</i>
en@shaw: <i>(ğ‘§ğ‘›ğ‘¦ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤)</i>

source: Native
en@shaw: ğ‘¯ğ‘±ğ‘‘ğ‘¦ğ‘

source: Script Type
en@shaw: ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘‘ ğ‘‘ğ‘²ğ‘

source: Script Recorder
en@shaw: ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘‘ ğ‘®ğ‘¦ğ‘’ğ‘ªğ‘®ğ‘›ğ‘»

source: The current script will be lost.
en@shaw: ğ‘ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘‘ ğ‘¢ğ‘¦ğ‘¤ ğ‘šğ‘° ğ‘¤ğ‘ªğ‘•ğ‘‘.

source: Confirm clear
en@shaw: ğ‘’ğ‘ªğ‘¯ğ‘“ğ‘»ğ‘¥ ğ‘’ğ‘¤ğ‘½

source: _Preferencesâ€¦
en@shaw: _ğ‘ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘•ğ‘©ğ‘Ÿâ€¦

source: Refresh all
en@shaw: ğ‘®ğ‘°ğ‘“ğ‘®ğ‘§ğ‘– ğ‘·ğ‘¤

source: Refresh selected nodeâ€™s children
en@shaw: ğ‘®ğ‘°ğ‘“ğ‘®ğ‘§ğ‘– ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¯ğ‘´ğ‘›'ğ‘• ğ‘—ğ‘¦ğ‘¤ğ‘›ğ‘®ğ‘©ğ‘¯

source: Alt
en@shaw: ğ‘·ğ‘¤ğ‘‘

source: Ctrl
en@shaw: ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘®ğ‘´ğ‘¤

source: Shift
en@shaw: ğ‘–ğ‘¦ğ‘“ğ‘‘

source: _Add Bookmarkâ€¦
en@shaw: _ğ‘¨ğ‘› ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’â€¦

source: Bookmark selected accessible.
en@shaw: ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤.

source: _Edit Bookmarksâ€¦
en@shaw: _ğ‘§ğ‘›ğ‘¦ğ‘‘ ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’ğ‘•â€¦

source: Manage bookmarks.
en@shaw: ğ‘¥ğ‘¨ğ‘¯ğ‘¦ğ‘¡ ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’ğ‘•.

source: Edit Bookmarksâ€¦
en@shaw: ğ‘§ğ‘›ğ‘¦ğ‘‘ ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’ğ‘•â€¦

source: Add Bookmarkâ€¦
en@shaw: ğ‘¨ğ‘› ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’â€¦

source: <i>_New viewâ€¦</i>
en@shaw: <i>_ğ‘¯ğ‘¿ ğ‘ğ‘¿â€¦</i>

source: New Viewâ€¦
en@shaw: ğ‘¯ğ‘¿ ğ‘ğ‘¿â€¦

# menu
source: _Bookmarks
en@shaw: _ğ‘šğ‘«ğ‘’ğ‘¥ğ‘¸ğ‘’ğ‘•

# menu
source: _View
en@shaw: _ğ‘ğ‘¿

# _
source: translator-credits
ne: pawan chitrakar <chautari@gmail.com>

# sort
source: 1. API Browser Plugin
ne: १. एपीआई ब्राउजर प्लगइन

source: Verifying interfaces, methods, and properties
ne: इन्टरफेसहरू, विधिहरू, र गुणहरू रुजु गर्दै

source: Eitan Isaacson
ne: इटान इसहाकसन

source: Peter Parente
ne: पिटर प्यारेन्ट

source: Aline Bessa
ne: एलाइन बेसा

source: Creative Commons Share Alike 3.0
ne: क्रिएटिव कमन्स साझा समान ३.०

source: API Browser Plugin
ne: एपीआई ब्राउजर प्लगइन

source: Given an accessible widget selected in the <link xref="desktop_tree_view">Application Tree View</link>, the API Browser Plugin shows its implemented AT-SPI interfaces along with its methods and properties.
ne: <link xref="desktop_tree_view">एप्लिकेसन ट्री भ्यू</link> मा चयन गरिएको पहुँच योग्य विजेट दिइएको छ, एपीआई ब्राउजर प्लगइनले यसको विधिहरू र गुणहरूको साथ यसको कार्यान्वयन गरिएको एटी-एसपीआई इन्टरफेसहरू देखाउँदछ।.

source: The API Browser Plugin allows you to verify interfaces, methods, and properties of a target accessible widget in an application.
ne: एपीआई ब्राउजर प्लगइनले तपाईंलाई अनुप्रयोगमा लक्षित पहुँच योग्य विजेटको इन्टरफेस, विधि हरू र गुणहरू प्रमाणित गर्न अनुमति दिन्छ।.

# _
source: external ref='figures/api_browser.png' md5='4f668e4a15d1c308e984d0801b9ecd95'
ne: बाह्य रेफरी = 'आंकड़े / api_browser.png' एमडी 5 = '4 एफ 668 ई 4 ए 15 डी 1 सी 308 ई 984 डी 0801 बी 9 ईसीडी 95'

source: Running the API Browser Plugin
ne: एपीआई ब्राउजर प्लगइन चलिरहेको छ
